{"id":946,"date":"2007-12-19T23:49:00","date_gmt":"2007-12-19T23:49:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2007\/12\/19\/alucinando-con-el-gobierno\/"},"modified":"2007-12-19T23:49:00","modified_gmt":"2007-12-19T23:49:00","slug":"alucinando-con-el-gobierno","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/trastero\/alucinando-con-el-gobierno\/","title":{"rendered":"Alucinando con el gobierno"},"content":{"rendered":"<p>Y es que llevan una racha que parece que quieren lograr el m\u00e1s rid\u00edculo todav\u00eda. As\u00ed que como hace un momento me he sentido ligeramente molesto al ver en la televisi\u00f3n como se dedican a insultarse amablemente los ministros pues, ale, aqu\u00ed mis opiniones sobre el actual gobierno:<\/p>\n<ol><\/p>\n<li><strong>La inmigraci\u00f3n.<\/strong> Creo que se les ha ido de las manos. Estoy de acuerdo que la inmigraci\u00f3n es algo bueno pero me parece que la capacidad de absorci\u00f3n de inmigrantes en el pa\u00eds est\u00e1 siendo superada ampliamente&#8230;<\/li>\n<p><\/p>\n<li><strong>El poder adquisitivo espa\u00f1ol.<\/strong> Veamos, por mucho que digan que ahora tenemos un poder adquisitivo mayor que hace unos a\u00f1os (escuchado hace unos momentos por su propia boca), \u00bfqui\u00e9n de las personas no ricas puede decir que se siente m\u00e1s rico? Es m\u00e1s, recuerdo haber le\u00eddo por ah\u00ed que el salario real y pr\u00e1ctico de un espa\u00f1ol de pie es un 30 y pico por cierto inferior al que era hace unos cuantos a\u00f1os. Lo cu\u00e1l dice mucho. Y lo gracioso es que estoy seguro que ellos lo saben, porque sino no dir\u00edan cosas como las del conejo \u00ac\u00ac<\/li>\n<p><\/p>\n<li><strong>La vivienda.<\/strong> \u00c9sto ya es irrisorio totalmente, pero hasta niveles que superan con creces la verg\u00fcenza. \u00bfEn que cabeza cabe que alguien pueda comprar con los precios actuales? \u00bfY en qu\u00e9 ojos no entra el ver como est\u00e1 todo lleno de carteles de se vende y que el precio est\u00e1 bajando en lo que promete un tortazo descomunal en no mucho tiempo? Pero claro, todo va bien.<\/li>\n<p><\/p>\n<li><strong>Las ayudas al alquiler.<\/strong> Venga, va, la idea no est\u00e1 mal, pero tambi\u00e9n es bastante curioso que el estado promete mucho y luego resulta que pasa a ser competencia de cada comunidad aut\u00f3noma y que encima no habr\u00e1 un mayor caudal de dinero a las comunidades, sino que tendr\u00e1n que financiarse ellas mismas con el mismo dinero que hasta ahora.<\/li>\n<p><\/p>\n<li><strong>La pol\u00edtica de medio ambiente.<\/strong> Y yo voy y me creo que est\u00e1n haciendo las cosas bien solamente por sus anuncios en la televisi\u00f3n. Claro, por eso se recalifican zonas verdes emblem\u00e1ticas y el gobierno cierra los ojos y no oye nada; y si hablamos de las energ\u00edas renovables&#8230; en fin, que alguien nos coja confesados (no me explayo en este tema porque he hablado mucho sobre este tema xD)<\/li>\n<p><\/p>\n<li><strong>Las l\u00edneas de alta velocidad.<\/strong> Por mi se las podr\u00edan haber guardado y haber obligado a mejorar el P\u00c9SIMO servicio regional que es el que realmente se usa y no las l\u00edneas de alta velocidad que se usan puntualmente.<\/li>\n<p><\/p>\n<li><strong>La ley de discriminaci\u00f3n positiva.<\/strong> El nombre lo dice todo y hace nada que habl\u00e9 de ello: la discriminaci\u00f3n SIEMPRE es mala y adem\u00e1s que su propio nombre es un insulto.<\/li>\n<p><\/p>\n<li><strong>Las inversiones en nuevas tecnolog\u00edas.<\/strong> Creo que  nunca he visto algo m\u00e1s rid\u00edculo en mi vida. Mira mam\u00e1, que voy a invertir en la bolsa&#8230; \u00a1\u00a1voy a mirar el peri\u00f3dico todos los d\u00edas y ya est\u00e1!! \u00bfPero nada m\u00e1s? No, con eso llega&#8230; Pues algo as\u00ed con nuestras altas tecnolog\u00edas que se basan en poner adsl por el pa\u00eds&#8230; Y es que ni siquiera hacen eso bien y nos dicen que es de los mejores de Europa y resulta que es caro y lento&#8230;<\/li>\n<p><\/p>\n<li><strong>El I+D+I.<\/strong> Eso no existe, solo hay que ver la ruina de becarios doctorales que tenemos y si encima acabas el doctorado, pues resulta que si tienes suerte seguir\u00e1s siendo becario pero post-doctoral, que es un lujo (m\u00e1s detalles <a href=\"http:\/\/precarios.org\/tiki-index.php\">precarios.org<\/a>). Seguimos con la filosof\u00eda de que las cosas se hagan fuera y por mucho plan de &#8220;recuperaci\u00f3n de cerebros&#8221;, parece que la recuperaci\u00f3n ha sido negativa viendo los resultados.<\/li>\n<p><\/p>\n<li><strong>Facilidad de creaci\u00f3n de empresas.<\/strong> Casi como en otros pa\u00edses que con unos euros te fundas una empresa, mientras que aqu\u00ed como poco son unos 3000\u20ac<\/li>\n<p><\/p>\n<li><strong>Mejoras en la cohesi\u00f3n del pa\u00eds.<\/strong> Y s\u00ed que \u00e9sto me parece grave, porque en mi opini\u00f3n se ha dado mucho m\u00e1s peso a unas comunidades aut\u00f3nomas que a otras (v\u00e9ase aquellas mediterr\u00e1neas) y eso es discriminatorio para las comunidades m\u00e1s pobres y todo por el poder pol\u00edtico porque si fuera por la historia de cada comunidad, hay comunidades con una historia mucho m\u00e1s trascendente y que han sido mancilladas sin rodeos (no hace falta dar m\u00e1s vueltas, Castilla y Le\u00f3n no acogi\u00f3 muy amablemente la fusi\u00f3n en una hace muy poco, pero hay que ver como de \u00e9sto no dicen nada, total, no hay dinero que lo haga importante).<\/li>\n<p><\/p>\n<li><strong>El terrorismo.<\/strong> La cabeza de la banda terrorista hab\u00eda sido eliminada hace un tiempo y lo \u00fanico que han conseguido en este tiempo es que se rearmase, porque estaba claro que no se iba a llegar a ninguna parte con una posici\u00f3n como la del terrorismo.<\/li>\n<p><\/p>\n<li><strong>Calidad de los puestos de trabajo.<\/strong> Parece que la \u00faltima de los aut\u00f3nomos est\u00e1 bien pero&#8230; \u00bfpor qu\u00e9 tenemos unos salarios tan irrisorios respecto a los precios del propio pa\u00eds y unos derechos labolares que parecen menores a los que hab\u00eda antes? Porque un contrato indefinido de ahora es de risa respecto a los de antes.<\/li>\n<p><\/p>\n<li><strong>Regulaci\u00f3n de los ingenieros inform\u00e1ticos. <\/strong>Que s\u00ed, que total lo de ingeniero se puso para quedar bonito.<\/li>\n<p><\/p>\n<li><strong>Canon a todo.<\/strong> \u00bf12 euros de canon por un disco duro? Pufff&#8230;<\/li>\n<p><\/p>\n<li><strong>M\u00ednimo de pel\u00edculas espa\u00f1olas en el cine. <\/strong>\u00bfEs que somos borregos y no podemos escoger lo que queremos ver? Ahora la cantidad de pel\u00edculas espa\u00f1olas por ley en la cartelera es tan burra, que ya hay pel\u00edculas de fuera que no llegan a ciudades donde hay uno o dos cines. Ejemplo cercano: Stardust.<\/li>\n<p><\/p>\n<li><strong>Seguridad vial.<\/strong> M\u00e1s parece que lo que quieren es recaudar, porque despu\u00e9s del &#8220;susto&#8221; inicial, ya vuelve otra vez todo a niveles parecidos a los anteriores y es que lo mismo ha pasado en otros pa\u00edses. \u00bfNo ser\u00eda mejor invertir en mejorar la calidad de las v\u00edas que tenemos ahora en lugar de poner tanto radar dispuesto a poner multas? Curiosamente la mayor cantidad de radares se encuentra (a oj\u00edmetro) en las autov\u00edas, pero la mayor cantidad de accidentes est\u00e1n en las redes secundarias, que curioso, \u00bfno?<\/li>\n<p><\/ol>\n<p>Y no me vale la excusa que suelen dar que todo estaba mal antes&#8230; porque las cosas ni han mejorado ni se han estabilizado, sino que han empeorado y lo peor es que nos lo quieren ocultar con sus ch\u00e1charas de que todo est\u00e1 bien.<\/p>\n<p>Arrggg, es que \u00faltimamente me he sentido insultado por el gobierno, porque cada d\u00eda que pasa sueltan cada comentario que parece que lo hacen a posta \u00ac\u00ac<\/p>\n<p><strong>Pd.<\/strong> Por cierto, estoy seguro que me he dejado muchas cosas en el tintero&#8230; errr, teclado xD<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Y es que llevan una racha que parece que quieren lograr el m\u00e1s rid\u00edculo todav\u00eda. As\u00ed que como hace un momento me he sentido ligeramente molesto al ver en la televisi\u00f3n como se dedican a insultarse amablemente los ministros pues, ale, aqu\u00ed mis opiniones sobre el actual gobierno: La inmigraci\u00f3n. Creo que se les ha [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[873],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Alucinando con el gobierno - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/trastero\/alucinando-con-el-gobierno\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Alucinando con el gobierno - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Y es que llevan una racha que parece que quieren lograr el m\u00e1s rid\u00edculo todav\u00eda. As\u00ed que como hace un momento me he sentido ligeramente molesto al ver en la televisi\u00f3n como se dedican a insultarse amablemente los ministros pues, ale, aqu\u00ed mis opiniones sobre el actual gobierno: La inmigraci\u00f3n. Creo que se les ha [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/trastero\/alucinando-con-el-gobierno\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2007-12-19T23:49:00+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/trastero\/alucinando-con-el-gobierno\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/trastero\/alucinando-con-el-gobierno\/\",\"name\":\"Alucinando con el gobierno - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2007-12-19T23:49:00+00:00\",\"dateModified\":\"2007-12-19T23:49:00+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/trastero\/alucinando-con-el-gobierno\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-fg","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/946"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=946"}],"version-history":[{"count":0,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/946\/revisions"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=946"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}