{"id":1230,"date":"2007-02-05T10:11:00","date_gmt":"2007-02-05T10:11:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2007\/02\/05\/windows-vista-huele-fatal\/"},"modified":"2016-02-20T23:38:09","modified_gmt":"2016-02-20T23:38:09","slug":"windows-vista-huele-fatal","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/sistemas-operativos\/windows\/windows-vista-huele-fatal\/","title":{"rendered":"Windows Vista huele fatal\u2026"},"content":{"rendered":"<p>Y s\u00ed&#8230; es escuchar esas palabras y pensar&#8230; \u00bfcaca?<\/p>\n<p>Es cierto que voy a hablar sin haberlo probado, pero es qu\u00e9 tampoco tengo curiosidad por verlo despu\u00e9s de ver las <em>especificaciones<\/em> tan <em>geniales<\/em> que posee.<br \/>Que Microsoft sea una empresa que innove es algo que se puede poner muuuuy en entredicho, sobre todo porque su verdadera fuerza est\u00e1 en sus compras y en sus promociones, pero s\u00ed que es cierto que ha tra\u00eddo la inform\u00e1tica al mundo real (quiz\u00e1s hubiera sido otro en su lugar si \u00e9ste no hubiera sido, pero bueno, que les toc\u00f3 a \u00e9stos).<\/p>\n<p>Sus Windows han ido evolucionando de una manera un tanto err\u00e1tica, tanto que realmente si me preguntan, no veo una gran diferencia entre el Windows 95 y el XP, solo mejoras y actualizaciones, pero no grandes novedades.<\/p>\n<p>Y llegamos a su <strong>Microsoft Windows Vista<\/strong>, su \u00faltimo sistema operativo que tendr\u00eda que haber salido hace unos a\u00f1os, del que han quitado un mont\u00f3n de funcionalidades con las que no llegaban a tiempo (\u00a1\u00a1y eso que llevan a\u00f1os de retraso!!), y que visto lo visto, espero que tenga una graaaaan ca\u00edda (y que conste que la gran mayor\u00eda de opiniones especializadas piensan que es un desatino este sistema operativo).<\/p>\n<p>\u00bfPor qu\u00e9 quiero \u00e9sto? Lo enumerar\u00e9 por pasos:<\/p>\n<ol><\/p>\n<li><strong>Su precio.<\/strong> Me parece exagerado. Sali\u00f3 a la venta en cinco versiones diferentes y, la \u00fanica completa, la Ultimate, cuesta 600\u20ac&#8230; \u00a1\u00a1Si hay equipos que valen menos que eso!!<\/li>\n<p><\/p>\n<li><strong>Sus requerimientos.<\/strong> Son incre\u00edbles O_O Si bien se puede ejecutar en ordenadores vendidos el a\u00f1o pasado de media, en muy pocos lo podr\u00e9is ejecutar sin recortar las famosas bondades visuales que trae (el sistema Aero del que est\u00e1n tan orgullosos pero que parece arcaico al comparar con un Mac o el Beryl de Linux). Tarjetas gr\u00e1ficas de 256 megas, 1 giga de RAM, sobre 20 gigas de disco duro, un micro poderoso como pocos&#8230; Son muchas cosas para que funcione un sistema operativo, porque hay que recordar que aparte se tendr\u00e1n que ejecutar los programas que querramos&#8230; Es decir, necesitar\u00edamos una grandiosa m\u00e1quina de tecnolog\u00eda punta para hacer lo mismo que tenemos ahora y, por supuesto, que los port\u00e1tiles se olviden de ejecutarlo a pleno rendimiento, salvo \u00faltimos modelos que no quieran ir con bateria&#8230; (\u00bfos acord\u00e1is aquella noticia que sali\u00f3 hace un a\u00f1o en la que una beta de este sistema operativo se com\u00eda la bater\u00eda de un portatil en minutos?)<\/li>\n<p><\/p>\n<li><strong>Su incompatibilidad.<\/strong> S\u00ed, \u00e9sto en parte es l\u00f3gico dado que acaba de salir, pero hay muchos programas que no funcionan (hasta algunos del Microsoft Office 2003 O_O) y sacarlo al mercado con esta limitaci\u00f3n no me parece lo m\u00e1s apropiado. Encima, en el apartado de sonido se han saltado todo lo habido y por haber, no funciona el EAX, ni el Dolby Surround ni casi nada&#8230; Es decir, que si ten\u00edais un 5:1 ya os pod\u00e9is olvidar de \u00e9l en juegos.<\/li>\n<p><\/p>\n<li><strong>Malas jugadas para actualizar.<\/strong> Por aqu\u00ed dir\u00e9 que las nuevas DirectX 10 solo funcionen en el Vista con la excusa que no podr\u00eda funcionar en XP por su integraci\u00f3n con el sistema, es una explicaci\u00f3n muy forzada&#8230; Yo lo veo como una manera de obligar a los que quieran jugar a los \u00faltimos juegos a migrar a Vista.<br \/>Y bueno, otro detalle&#8230; \u00bfSab\u00edais que si compr\u00e1is una actualizaci\u00f3n de XP a Vista se anula la licencia del XP? Pues s\u00ed se\u00f1ores, llegamos a la tonter\u00eda del d\u00eda&#8230; Se os quita algo que hab\u00edais comprado y, es m\u00e1s, al ser una actualizaci\u00f3n, si tuvierais que reinstalar el sistema, no podr\u00edais porque el Vista necesita del XP, pero el XP no tendr\u00eda licencia&#8230; \u00bfA qu\u00e9 es divertido?<\/li>\n<p><\/p>\n<li><strong>Su rendimiento.<\/strong> Dicen que una vez que arranca y est\u00e1 m\u00e1s o menos sobrado, su estabilidad es bastante buena&#8230; Pero tambi\u00e9n es cierto que tiene un rendimiento peor que Windows XP (entre un 15 a un 18% m\u00e1s lento) y que se pone a consumir 600 megas de RAM el solito. Ya s\u00e9 que la RAM est\u00e1 para ser usada, pero un sistema operativo deber\u00eda tirar de esas cantidades solo puntualmente&#8230; Esa memoria es en estabilidad con lo que o tienes 2 gigas en el ordenador o ya puedes ir viendo como la lucecita de tu disco duro se enciende sin parar para hacer swapping.<\/li>\n<p><\/p>\n<li><strong>El DRM.<\/strong> Y llegamos al peor de los desprop\u00f3sitos (y que no ver\u00e9is en su publicidad). Para proteger los derechos de las productoras y dem\u00e1s amigos, en lugar de buscar nuevos modos de negocio o algo que incentivase al usuario a comprar, lo que se ha hecho es castigar directamente al usuario y ponerle cadenas como si fuera un reo. Veamos, resulta que si tienes una salida anal\u00f3gica de audio de calidad, el sistema operativo producir\u00e1 peor sonido para que no puedas intentar grabarlo. Si tienes una conexi\u00f3n no firmada por Microsoft con un TFT o una televisi\u00f3n, los DVD o lo que sea que reproduzca Vista, lo har\u00e1 empeorando la calidad, para que no tengas tentaciones de copiar algo que ves mal (y les da igual que te hayas comprado el DVD, tu lo ver\u00e1s mal porque tu TFT no es de los seguros de Microsoft).<br \/>Entonces, si quieres ver algo en tu equipo, prep\u00e1rate a poner todos los perif\u00e9ricos homologados y con conexiones que puedan desencriptar y asegurar que no hay posibilidad de copia.<\/li>\n<p><\/ol>\n<p>Despu\u00e9s de estos puntos, os aseguro que por un lado no me voy a comprar un ordenador nuevo para ejecutar semejante adefesio de sistema operativo, que seguir\u00e9 con mi Linux en el portatil (s\u00ed, llevo unos 2 meses ya de uso exclusivo linuxero ^^) y que, si no me sintiera seguro con Linux, me comprar\u00eda antes un Mac (aunque tambi\u00e9n lleva un mont\u00f3n de protecciones DRM, pero por lo menos funciona bien) que un PC nuevo de \u00faltima generaci\u00f3n con Vista&#8230;<\/p>\n<p>Ah, y como curiosidad final, el d\u00eda de su puesta en venta, ya hab\u00eda cinco actualizaciones para \u00e9l&#8230; Lo cual quiere decir que el acabado no es que est\u00e9 muy bien&#8230;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Y s\u00ed&#8230; es escuchar esas palabras y pensar&#8230; \u00bfcaca? Es cierto que voy a hablar sin haberlo probado, pero es qu\u00e9 tampoco tengo curiosidad por verlo despu\u00e9s de ver las especificaciones tan geniales que posee.Que Microsoft sea una empresa que innove es algo que se puede poner muuuuy en entredicho, sobre todo porque su verdadera [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[693],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Windows Vista huele fatal\u2026 - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/sistemas-operativos\/windows\/windows-vista-huele-fatal\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Windows Vista huele fatal\u2026 - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Y s\u00ed&#8230; es escuchar esas palabras y pensar&#8230; \u00bfcaca? Es cierto que voy a hablar sin haberlo probado, pero es qu\u00e9 tampoco tengo curiosidad por verlo despu\u00e9s de ver las especificaciones tan geniales que posee.Que Microsoft sea una empresa que innove es algo que se puede poner muuuuy en entredicho, sobre todo porque su verdadera [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/sistemas-operativos\/windows\/windows-vista-huele-fatal\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2007-02-05T10:11:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-20T23:38:09+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/sistemas-operativos\/windows\/windows-vista-huele-fatal\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/sistemas-operativos\/windows\/windows-vista-huele-fatal\/\",\"name\":\"Windows Vista huele fatal\\u2026 - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2007-02-05T10:11:00+00:00\",\"dateModified\":\"2016-02-20T23:38:09+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/sistemas-operativos\/windows\/windows-vista-huele-fatal\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-jQ","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1230"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=1230"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1230\/revisions"}],"predecessor-version":[{"id":2268,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1230\/revisions\/2268"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=1230"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=1230"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=1230"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}