{"id":922,"date":"2008-02-01T01:51:00","date_gmt":"2008-02-01T01:51:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2008\/02\/01\/jugando-al-dawn-of-war-en-linux\/"},"modified":"2016-02-19T11:45:05","modified_gmt":"2016-02-19T11:45:05","slug":"jugando-al-dawn-of-war-en-linux","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/juegos\/jugando-al-dawn-of-war-en-linux\/","title":{"rendered":"Jugando al Dawn of War en Linux"},"content":{"rendered":"<p>La verdad es que fue uno de los motivos que m\u00e1s me echaron para atr\u00e1s en su d\u00eda, cuando quise hacerme totalmente linuxero&#8230; \u00bf\u00bf\u00bfd\u00f3nde iban a estar esos juegos guays a los que viciarme??? Porque realmente ports nativos hay pocos (Doom 3, Neverwinter Night 1 y alguno m\u00e1s por ah\u00ed) y para todo el resto hay que encomendarse a los poderes divinos de lo que no es una emulaci\u00f3n pero a los ojos lo parece&#8230; \u00a1<strong>Wine<\/strong>!<\/p>\n<p>Wine es una obra de arte de la ingenieria que se basa en ofrecer unas librer\u00edas que hacen m\u00e1s o menos lo mismo que sus equivalentes de Windows, con lo que algunas aplicaciones creen realmente que est\u00e1n bajo Windows (lo incre\u00edble es que consiguen hacer funcionar el windows update o hasta el mismo certificate y pasarlo xD). Pero claro, los juegos son harina de otro costal y son consumidores tremendos de recursos y habilidades.<\/p>\n<p>M\u00e1s o menos, Wine tiene implementada las directx 9 hasta no s\u00e9 qu\u00e9 revisi\u00f3n (mi memoria es mala&#8230; la edad), as\u00ed que me decid\u00ed a meterle directamente la expansi\u00f3n de los Necrones (\u00a1\u00a1\u00a1muertos o muertos, ellos ir\u00e1n a la tumba!!!), es decir <strong>Dark Crusade<\/strong>&#8230; \u00bfY qu\u00e9 pas\u00f3? Pues el pr\u00f3ximo episodio lo ten\u00e9is en el siguiente p\u00e1rrafo ;)<\/p>\n<p>M\u00e1s o menos todo se ve\u00eda bien (el v\u00eddeo de la intro un poco a tirones) y era usable (en este momento mi cara de felicidad era grande) Me puse a jugar un poco y pasaron dos cosas. La primera fue un cuelgue total, que me devolvi\u00f3 a Linux con una ventanita la mar de guay de si quer\u00eda enviar un informe de errores a Microsoft (errr&#8230; s\u00ed, ya ver\u00e1s que cara pondr\u00edan al ver el SO) y la siguiente intentona fue un pel\u00edn curiosa. Empec\u00e9 a jugar, termin\u00e9 de construir la primera estructura y&#8230; ta chaaaan&#8230; \u00a1\u00a1\u00a1fuera luces!!! B\u00e1sicamente se pod\u00eda seguir jugando, pero era como si hubieran apagado las luces&#8230; \u00bfas\u00ed como pretenden que conquiste el mundo? \u00ac\u00ac<\/p>\n<p>En fin, que entonces prob\u00e9 con <strong>Cedega<\/strong>, que b\u00e1sicamente es una versi\u00f3n de Wine que est\u00e1 enfocada a los juegos y como peculiaridad, tiene unos cuantos juegos de Windows certificados con funcionamiento correcto en Cedega. En fin, c\u00f3mo no pod\u00eda ser de otra forma, los necrones no estaban certificados (cualquiera los certifica con la mala leche que tienen), as\u00ed que toco probar y&#8230; tan taan taaan&#8230; \u00a1\u00a1Fallo total!! \u00a1\u00a1Ni siquiera instalaba!!<\/p>\n<p>Eso me llam\u00f3 poderosamente la atenci\u00f3n y me puse a investigar por ah\u00ed, hasta que encontr\u00e9 la buenaventura perdida en alg\u00fan or\u00e1culo m\u00edstico (b\u00e1sicamente un foro) en el cual contaban que hab\u00eda un problema con los instaladores m\u00e1s o menos modernos (\u00bf?) y que lo mejor que se pod\u00eda hacer era instalarlo en un Windows y volcarlo todo a alg\u00fan lugar compartido. Vale, por eso no habr\u00eda problema, dije yo, que para algo tengo el VirtualBox a mano por si acaso. As\u00ed que lo instal\u00e9 ah\u00ed (m\u00faltiples ventanitas de no aceleraci\u00f3n ni sonido sal\u00edan&#8230; \u00bfpero que va a hacer una m\u00e1quina virtual sino?) y despu\u00e9s volqu\u00e9 todo a Linux&#8230; Y s\u00ed, podr\u00eda haber hecho esto directamente con Wine, pues s\u00ed, pero luego hab\u00eda que exportar una rama del registro que hac\u00eda el instalador a Cedega (dentro del entorno de  cada juego, hay un system.reg, el cual representa el registro para ese entorno) y a\u00f1adir esa entrada. Creo que con Wine hubiera podido, \u00a1\u00a1pero me apetec\u00eda jugar!!<\/p>\n<p>Y con eso y un bizcocho&#8230; \u00a1\u00a1\u00a1empez\u00f3 el juego perfectamente!!! Bueno, casi, pero por so\u00f1ar que no quede. A\u00f1adidos los links a mano dentro del entorno, y ejecutada la herramienta de configuraci\u00f3n previa, ya arranc\u00f3 el juego y todo bien salvo dos detalles (pardiez con ese n\u00famero):<\/p>\n<ol><\/p>\n<li>No hab\u00eda sonido. \u00c9sto fue f\u00e1cilmente superable. Solo tuve que rebajar el motor de Cedega a uno de la versi\u00f3n 5 y ya volvi\u00f3 el sonido (Cedega tiene una serie de motores que puedes ir cambiando a placer; curiosamente hay juegos que funcionan bien en algunas versiones y otros en otras)<\/li>\n<p><\/p>\n<li>El puntero del raton tiene una curiosa m\u00e1scara alrededor. Me record\u00f3 a mis tiempos de 8 bits intentando programar un juego en el que hab\u00eda que poner m\u00e1scaras en ensamblador para que parec\u00eda que las cosas se mov\u00edan. Para \u00e9sto no he tenido soluci\u00f3n (aunque no es muy importante, porque se ve a trav\u00e9s de esa m\u00e1scara) y creo que tiene que ver con mi ATI tonta&#8230;<\/li>\n<p><\/ol>\n<p>As\u00ed que s\u00ed, ah\u00ed ten\u00e9is como jugar a \u00e9ste magn\u00edfico juego del que habl\u00e9 aqu\u00ed hace un tiempecillo.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>La verdad es que fue uno de los motivos que m\u00e1s me echaron para atr\u00e1s en su d\u00eda, cuando quise hacerme totalmente linuxero&#8230; \u00bf\u00bf\u00bfd\u00f3nde iban a estar esos juegos guays a los que viciarme??? Porque realmente ports nativos hay pocos (Doom 3, Neverwinter Night 1 y alguno m\u00e1s por ah\u00ed) y para todo el resto [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[872],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Jugando al Dawn of War en Linux - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/karstieltopia.com\/ocio\/juegos\/jugando-al-dawn-of-war-en-linux\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Jugando al Dawn of War en Linux - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"La verdad es que fue uno de los motivos que m\u00e1s me echaron para atr\u00e1s en su d\u00eda, cuando quise hacerme totalmente linuxero&#8230; \u00bf\u00bf\u00bfd\u00f3nde iban a estar esos juegos guays a los que viciarme??? Porque realmente ports nativos hay pocos (Doom 3, Neverwinter Night 1 y alguno m\u00e1s por ah\u00ed) y para todo el resto [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/karstieltopia.com\/ocio\/juegos\/jugando-al-dawn-of-war-en-linux\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2008-02-01T01:51:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-19T11:45:05+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/karstieltopia.com\/ocio\/juegos\/jugando-al-dawn-of-war-en-linux\/#webpage\",\"url\":\"https:\/\/karstieltopia.com\/ocio\/juegos\/jugando-al-dawn-of-war-en-linux\/\",\"name\":\"Jugando al Dawn of War en Linux - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2008-02-01T01:51:00+00:00\",\"dateModified\":\"2016-02-19T11:45:05+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/karstieltopia.com\/ocio\/juegos\/jugando-al-dawn-of-war-en-linux\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-eS","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/922"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=922"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/922\/revisions"}],"predecessor-version":[{"id":1825,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/922\/revisions\/1825"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=922"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=922"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=922"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}