{"id":695,"date":"2009-02-09T01:16:00","date_gmt":"2009-02-09T01:16:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2009\/02\/09\/teniendo-malos-pensamientos-sobre-renfe\/"},"modified":"2016-02-20T13:38:50","modified_gmt":"2016-02-20T13:38:50","slug":"teniendo-malos-pensamientos-sobre-renfe","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/trastero\/teniendo-malos-pensamientos-sobre-renfe\/","title":{"rendered":"Teniendo malos pensamientos sobre RENFE"},"content":{"rendered":"<p>Y ya es que con la \u00faltima que me ha pasado ya no puedo pensar otra salvo que RENFE es un caos y una verg\u00fcenza como entidad.<\/p>\n<p>B\u00e1sicamente la \u00faltima fue hace un par de d\u00edas, cu\u00e1ndo me acerqu\u00e9 a Valladolid. Como quise ser previsor, compr\u00e9 los billetes unas 3 semanas antes y la ida era en un Avant (que tarda un poco m\u00e1s de 1 hora). Bien, una vez que llegu\u00e9 all\u00ed y tuve que pasar la est\u00fapida cola para que me ticaran el billete (se hace en el anden) y que pasasen mis cosas por un detector de metales (claro, \u00bfqui\u00e9n llevar\u00eda un arma encima, sino que la dejar\u00eda en la maleta sabiendo que por ah\u00ed la van a escanear?) me dispongo a ir a mi asiento y, oh, sorpresa, hab\u00eda una personilla ah\u00ed.<\/p>\n<p>Despu\u00e9s del habitual intercambio de palabras tipo &#8220;Eh, \u00a1qu\u00e9 ese es mi asiento!&#8221;, &#8220;No, qu\u00e9 este es m\u00edo&#8221;, &#8220;Ens\u00e9\u00f1ame tu billete&#8221;, etc&#8230; vimos con un ligero estupor que, pardiez&#8230; \u00a1\u00a1nos hab\u00edan vendido el mismo billete a los dos!! Y claro, como ya hab\u00edan mirado el billete fuera (que por cierto, es algo automatizado porque escanean el billete), no hab\u00eda ning\u00fan revisor a la vista.<\/p>\n<p>Dentro de lo malo, tuve suerte y quedaba un asiento libre en el mismo vag\u00f3n y me pude sentar&#8230; Cuando llev\u00e1bamos 30 minutos o as\u00ed, vi pasar a un trabajador de RENFE y se lo dije y no le dio la m\u00e1s m\u00ednima importancia porque, total, no era el \u00fanico en todo el tren, sino que hab\u00eda otros 3 casos m\u00e1s. Incre\u00edble, y no solo eso, sino que es algo que pasa con relativa frecuencia.<\/p>\n<p>Pero vamos a ver, \u00bfc\u00f3mo demonios venden el mismo billete dos veces?<\/p>\n<p>Aunque claro, por otro lado no me estra\u00f1a. Si hab\u00e9is entrado en su p\u00e1gina web e intent\u00e1is comprar un billete online con el firefox (no s\u00e9 que pasar\u00e1 con el Explorer), os asaltar\u00e1 un mensaje de peligro total dado que la p\u00e1gina web est\u00e1 firmado con un certificado que no est\u00e1 homologado internacionalmente y claro, salvo que confirmes que es v\u00e1lido, no podr\u00e1s pasar a los siguientes pasos (manda leches que se autofirmen las cosas en el pa\u00eds y luego no se intenten homologar con el resto del mundo, as\u00ed se hacen las cosas).<\/p>\n<p>Y ya saliendo de las cosas t\u00e9cnicas. \u00bfPor qu\u00e9 demonios tenemos una red de tren tan desastrosa? \u00bfPor qu\u00e9 los regionales dan asco, tienen malos horarios y no comunican las cosas de manera que puedas ir a trabajar c\u00f3modamente con ellos? Aun recuerdo cuando estudiaba en Le\u00f3n y me iba a Ponferrada en un regional que parec\u00eda un remolque para animales y que hab\u00eda veces que en pleno invierno, pas\u00e1bamos el puerto de monta\u00f1a a c\u00e1mara lenta sin calefacci\u00f3n (recuerdo perf\u00e9ctamente como el Nokia que ten\u00eda tardaba segundos y segundos en responder a cada orden que daba debido al fr\u00edo).<\/p>\n<p>Y lo \u00faltimo es ver los precios tan abusivos que est\u00e1n empezando a poner&#8230; \u00bfC\u00f3mo puede ser que me sea bastante m\u00e1s barato un billete de ida y vuelta a Barcelona en avi\u00f3n que en tren? Te pueden decir que tienen precios especiales, pero claro, sacan s\u00f3lo unas pocas plazas a esos precios y, encima, ese precio tan barato es m\u00e1s o menos igual de caro que los aviones que puedes encontrar rebuscando un poco.<\/p>\n<p>En vez de tener un medio de transporte eficiente y bastante limpio, con el que adem\u00e1s se podr\u00edan transportar toneladas de mercanc\u00edas r\u00e1pidamente por todo el pa\u00eds, tenemos un medio de transporte totalmente anacr\u00f3nico, deficiente y vergonzoso. Y a\u00fan as\u00ed se enorgullecen cada vez que abren un nuevo AVE (que luego ir\u00e1 a c\u00e1mara lenta) incrementando espectacularmente el precio y dejan las antiguas comunicaciones apagadas&#8230;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Y ya es que con la \u00faltima que me ha pasado ya no puedo pensar otra salvo que RENFE es un caos y una verg\u00fcenza como entidad. B\u00e1sicamente la \u00faltima fue hace un par de d\u00edas, cu\u00e1ndo me acerqu\u00e9 a Valladolid. Como quise ser previsor, compr\u00e9 los billetes unas 3 semanas antes y la ida [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[873],"tags":[393,912,391,392],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Teniendo malos pensamientos sobre RENFE - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/trastero\/teniendo-malos-pensamientos-sobre-renfe\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Teniendo malos pensamientos sobre RENFE - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Y ya es que con la \u00faltima que me ha pasado ya no puedo pensar otra salvo que RENFE es un caos y una verg\u00fcenza como entidad. B\u00e1sicamente la \u00faltima fue hace un par de d\u00edas, cu\u00e1ndo me acerqu\u00e9 a Valladolid. Como quise ser previsor, compr\u00e9 los billetes unas 3 semanas antes y la ida [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/trastero\/teniendo-malos-pensamientos-sobre-renfe\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2009-02-09T01:16:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-20T13:38:50+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/trastero\/teniendo-malos-pensamientos-sobre-renfe\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/trastero\/teniendo-malos-pensamientos-sobre-renfe\/\",\"name\":\"Teniendo malos pensamientos sobre RENFE - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2009-02-09T01:16:00+00:00\",\"dateModified\":\"2016-02-20T13:38:50+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/trastero\/teniendo-malos-pensamientos-sobre-renfe\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-bd","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/695"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=695"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/695\/revisions"}],"predecessor-version":[{"id":2186,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/695\/revisions\/2186"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=695"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=695"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=695"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}