{"id":655,"date":"2009-05-14T02:01:00","date_gmt":"2009-05-14T02:01:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2009\/05\/14\/continuamos-las-aventuras-linuxeras\/"},"modified":"2016-02-20T05:48:55","modified_gmt":"2016-02-20T05:48:55","slug":"continuamos-las-aventuras-linuxeras","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/continuamos-las-aventuras-linuxeras\/","title":{"rendered":"Continuamos las aventuras linuxeras"},"content":{"rendered":"<p>Como todos os habr\u00e9is dado cuenta hace tiempo, pasado un cierto periodo, siento la necesidad de cargarme mi actual sistema operativo para ver las bondades de otros&#8230; S\u00e9 que podr\u00eda coger y virtualizar los otros para ver que tal son; lo \u00fanico es que despu\u00e9s las dependencias del hardware son tan fuertes que finalmente no me sirven esas pruebas.<\/p>\n<p>Pues bueno, he estado durante un mes o as\u00ed con una Kubuntu 9.04. La verdad es que la primera impresi\u00f3n me gust\u00f3 por la velocidad que ten\u00eda (y volver al apt-get, claro) pero poco a poco fui viendo los problemas que siempren acongojan a esta distribuci\u00f3n, los cuales los podemos resumir en una integraci\u00f3n p\u00e9sima de todo y que revienta por doquier.<\/p>\n<p>En fin, me lo imaginaba, as\u00ed que decid\u00ed dar el cambio a la versi\u00f3n de Ubuntu 9.04, la cu\u00e1l la hab\u00eda probado en el portatil y, demonios, iba muy bien. As\u00ed que aunque fuera con gnome, habr\u00eda que intentar usarla&#8230; Ainsss, inocente de mi, los cuelgues fueron continuos (mucho mayores que con la Kubuntu), as\u00ed que me imagino que hay algunas cosillas en mi hardware que no le acaban de gustar, as\u00ed que pardiez&#8230; \u00bfAhora que hago?<\/p>\n<p>Como ten\u00eda la mosquilla con gnome (eso de darle una oportunidad aun retumbaba), me tir\u00e9 hacia la SUSE 11.1 pero con gnome. Y bueno, funcionar funcionaba, pero&#8230; \u00a1\u00a1qu\u00e9 feo!! (vale, s\u00e9 de muchos que opinan lo mismo de kde, pero es que gnome parece una entorno de hace un par de millones de a\u00f1os y sin evolucionar). Claro, con esa perspectiva al d\u00eda siguiente estaba eliminado ya del sistema.<\/p>\n<p>Recordaba que SUSE siempre me hab\u00eda parecido estable, as\u00ed que volv\u00ed a la versi\u00f3n kde a trav\u00e9s de la versi\u00f3n reloaded que publicaron extraoficialmente desde SUSE (hay que recordar que SUSE s\u00f3lo saca una versi\u00f3n al a\u00f1o y justo coincidi\u00f3 cuando kde estaba todav\u00eda con la versi\u00f3n 4.1). La verdad es que me decepcion\u00f3 bastante la velocidad con la que iba, aunque era relativamente estable, pero lenta, lenta, lenta. Sinceramente creo que la integraci\u00f3n que hace SUSE de kde es muy buena, pero esa integraci\u00f3n fue para la versi\u00f3n 4.1 y \u00e9sta versi\u00f3n est\u00e1 en los repositorios no estables&#8230;<\/p>\n<p>As\u00ed que salto de nuevo, y esta vez a Fedora. Primero prob\u00e9 la versi\u00f3n beta de Leonidas, que se liberar\u00e1 en cuesti\u00f3n de un mes aproximadamente. Realmente me impresion\u00f3 lo moderna que es (aunque me aterroriz\u00f3 que solo arrancar hubiera un peque\u00f1o applet diciendo que mi disco duro ten\u00eda un fallo leve :S)&#8230; Molaba, molaba, as\u00ed que me puse a configurarlo y, jopelines, \u00a1revent\u00f3 tambi\u00e9n! Bueno, vale, se puede soportar porque era una versi\u00f3n beta&#8230; quiz\u00e1s la estable actual fuera bien, as\u00ed que la instal\u00e9 de nuevo y, \u00a1revent\u00f3n tambi\u00e9n!<\/p>\n<p>Sinceramente empezaba a ponerme mosca con tantos reventones que daba todo (o lentitude por parte de SUSE), \u00bftan poco soportado estaba mi sistema base?<\/p>\n<p>As\u00ed que pens\u00e9 en mis tres alternativas siguientes:<\/p>\n<ol><\/p>\n<li>Debian. La desestim\u00e9 casi de inmediato desde que supe que las versiones de 64 bits de kde estaban destrozadas y m\u00e1s por experiencias concretas para lograr ciertas cosas que se tienden a hacer en escritorio. Y reconozco que es una distribuci\u00f3n estupenda pero&#8230;<\/li>\n<p><\/p>\n<li>Arch. Ya sab\u00e9is que la he mencionado anteriormente. Es una distribuci\u00f3n en la que todo lo tocas t\u00fa, de arriba a abajo y te deja un sistema muy r\u00e1pido y con todo el software actual que quieras. Sin embargo por un lado no tengo mucho tiempo para ir probando (en cuanto la versi\u00f3n de kde &#8220;prefabricada est\u00e9 lista en 64 bits le echar\u00e9 un vistazo de nuevo; por si os interesa, el proyecto se llama Chakra y est\u00e1 aqu\u00ed) y adem\u00e1s es conocida la aversi\u00f3n de sus creadores hacia ATI, as\u00ed que vamos a dejarla por ahora.<\/li>\n<p><\/p>\n<li>Mandriva&#8230;<\/li>\n<p><\/ol>\n<p>Si se\u00f1ores, la tercera y gabacha opci\u00f3n es la que finalmente se ha llevado el trono durante una temporada al menos.<\/p>\n<p>Realmente no me lo esperaba (y eso que, junto con la Red Hat 7.0 fue de las primeras que us\u00e9 cuando todav\u00eda se llamaba Mandrake), pero todo fue genial desde el principio. Me baj\u00e9 la versi\u00f3n free de 64 bits (curiosamante la \u00fanica de 64 bits que hab\u00eda) y la instal\u00e9. Todo fue bien a la primera y utilizaba correctamente los paquetes de 64 bits (parece una tonter\u00eda, pero muchas distribuciones tienden a hacerse un l\u00edo intentando coger paquetes de 32 bits y armar un cacao tremendo).<\/p>\n<p>Una vez configurado y preparado en su versi\u00f3n de KDE 4.2.3 (actualic\u00e9 a los directorios cooker) s\u00f3lo os puedo decir que es tremendamente estable y r\u00e1pida; pardiez, creo que ning\u00fan linux hab\u00eda estado en estas condiciones en este ordenador.<\/p>\n<p>Tengo pendiente una mejor utilizaci\u00f3n del urpmi (gestor de paquetes) y creo que nada m\u00e1s&#8230;<\/p>\n<p>As\u00ed que si ten\u00e9is dudas, echar un vistazo profundo a vuestra distribuci\u00f3n gabacha amiga; por mucho que digan de que es una distro para principiantes o que no es nada en comparaci\u00f3n de Ubuntu, la verdad es que el acabado deja en rid\u00edculo a la distro &#8220;africana&#8221; y la facilidad de uso no implica ser para principiantes.<\/p>\n<p>\u00a1Hasta el pr\u00f3ximo venazo linuxero!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Como todos os habr\u00e9is dado cuenta hace tiempo, pasado un cierto periodo, siento la necesidad de cargarme mi actual sistema operativo para ver las bondades de otros&#8230; S\u00e9 que podr\u00eda coger y virtualizar los otros para ver que tal son; lo \u00fanico es que despu\u00e9s las dependencias del hardware son tan fuertes que finalmente no [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[64],"tags":[316,317,318,315,68,66],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Continuamos las aventuras linuxeras - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/continuamos-las-aventuras-linuxeras\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Continuamos las aventuras linuxeras - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Como todos os habr\u00e9is dado cuenta hace tiempo, pasado un cierto periodo, siento la necesidad de cargarme mi actual sistema operativo para ver las bondades de otros&#8230; S\u00e9 que podr\u00eda coger y virtualizar los otros para ver que tal son; lo \u00fanico es que despu\u00e9s las dependencias del hardware son tan fuertes que finalmente no [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/continuamos-las-aventuras-linuxeras\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2009-05-14T02:01:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-20T05:48:55+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/continuamos-las-aventuras-linuxeras\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/continuamos-las-aventuras-linuxeras\/\",\"name\":\"Continuamos las aventuras linuxeras - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2009-05-14T02:01:00+00:00\",\"dateModified\":\"2016-02-20T05:48:55+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/continuamos-las-aventuras-linuxeras\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-az","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/655"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=655"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/655\/revisions"}],"predecessor-version":[{"id":1782,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/655\/revisions\/1782"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=655"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}