{"id":1654,"date":"2016-02-27T07:36:41","date_gmt":"2016-02-27T06:36:41","guid":{"rendered":"http:\/\/karstieltopia.com\/?p=1654"},"modified":"2016-02-29T11:54:59","modified_gmt":"2016-02-29T10:54:59","slug":"dragon-age-inquisition","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/","title":{"rendered":"Dragon Age Inquisition, \u00bfel definitivo?"},"content":{"rendered":"<p>Hace ya mucho mucho tiempo que empec\u00e9 a jugar a esta saga de BioWare, como pod\u00e9is comprobar al ver los art\u00edculos sobre el <a href=\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/\">Dragon Age Origins<\/a> y sobre el <a href=\"http:\/\/karstieltopia.com\/ocio\/juegos\/terminando-el-dragon-age-2\/\">Dragon Age 2<\/a> y culmina con este Dragon Age Inquisition. Pues s\u00ed, siendo as\u00ed, ten\u00eda que jugar y terminar el Dragon Age Inquisition, es decir, el Dragon Age 3 y es un juego que empec\u00e9 a jugar hace m\u00e1s de un a\u00f1o en su versi\u00f3n de PC y que se puede decir que he terminado completamente hace un par meses m\u00e1s o menos (completamente implica que he jugado a todas sus expansiones).<\/p>\n<p><!--more--><\/p>\n<p>Bien, despu\u00e9s del gran Origin y del no tan bueno, pero tampoco tan malo Dragon Age 2, \u00bfqu\u00e9 podemos esperar del tres? Pues aunque hayan bastantes cr\u00edticas por ah\u00ed, creo que me atrevo a decir que es el mejor de la saga y que, despu\u00e9s de m\u00e1s de 200 horas de juego, podr\u00eda decir que lo he exprimido bastante.<\/p>\n<p><iframe  id=\"_ytid_18376\"  width=\"660\" height=\"371\"  data-origwidth=\"660\" data-origheight=\"371\"  src=\"https:\/\/www.youtube.com\/embed\/8BuTFWEPTz4?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=0&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=1&#038;fs=1&#038;playsinline=0&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"autoplay; encrypted-media\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/p>\n<p>Para situarnos, empezamos con un personaje totalmente nuevo, ni es el guarda gris del 1 ni Hawk del 2. Aqu\u00ed somos alguien que aparece en mitad de una explosi\u00f3n y somos capturados directamente por unos personajes que, si hemos jugado al 2, reconoceremos.<\/p>\n<p>De aqu\u00ed en adelante nos meteremos en una aventura totalmente \u00e9pica (aqu\u00ed nos olvidamos del aspecto m\u00e1s local del 2 que estaba siempre relacionado con Kirkwall) y tenemos el futuro de todo el mundo conocido en nuestras manos. Por cierto, si hab\u00e9is jugado a los Dragon Age anteriores, es muy importante que tambi\u00e9n hay\u00e1is jugado a los DLCs de los mismos, porque algunos de ellos repercuten en la historia principal del Dragon Age Inquisition.<\/p>\n<p>Dejando de lado la historia, porque no queremos hacer spoilers, tendremos un buen pu\u00f1ado de compa\u00f1eros con bastante carisma y con bastante conversaci\u00f3n (y por fin podremos equiparlos a nuestro gusto, que despu\u00e9s del 2 era algo que se echaba bastante de menos), un mundo bastante abierto, aunque no es un Skyrim. B\u00e1sicamente tenemos una serie de localizaciones en un mapa que se sit\u00faa entre Ferelden y Orlais y en la que cada una de ellas es totalmente gigantesca.<\/p>\n<p>Dispondremos de una serie de bases para nuestro desarrollo, armer\u00edas donde crear armas, armaduras, modificarlas, etc. y un mont\u00f3n de decisiones que ir\u00e1n cambiando el destino de nuestra inquisici\u00f3n.<\/p>\n<p>Por cierto, haciendo honor a su nombre, aparecen bastantes dragones y son los m\u00e1s espectaculares que he visto en ning\u00fan juego, tanto como por los combates con ellos, como por verlos revolotear por ah\u00ed, con su gigantesco tama\u00f1o.<\/p>\n<p>En cuanto al modo de juego, llevaremos un equipo en el que seremos un total de cuatro personajes (incluy\u00e9ndonos a nosotros), dejando en la &#8220;base&#8221; al resto de personajes que dispongamos. Todos iremos subiendo de nivel, inclusive aquellos que no vengan con nosotros y, como cada personaje tiene una personalidad bastante marcada, puede ser mejor llevar ciertos personajes para determinadas misiones en lugar de otros. Porque en la misma manera que en los dos juegos anteriores, aqu\u00ed tenemos que cuidar la afinidad con los personajes, porque si nos llevamos bastante mal con alguno de ellos, puede pasar que nos perdamos misiones, conversaciones, mejoras en ellos mismos o inclusive que dejen el grupo o nos ataquen vilmente (o no tan vilmente si es que los tratamos horriblemente). Y s\u00ed, como en los anteriores, tambi\u00e9n est\u00e1n los m\u00faltiples romances.<\/p>\n<p>El combate de este Dragon Age Inquisition es del mismo tipo que en el Dragon Age 2, aunque ahora tenemos un modo de \u00f3rdenes un tanto extra\u00f1o y que se nota much\u00edsimo que ha sido hecho para utilizar un gamepad en lugar de un rat\u00f3n. Las \u00f3rdenes que se pueden dar a los compa\u00f1eros son un tanto extra\u00f1as en su ejecuci\u00f3n y, aunque no es la mejor de las formas de hacerlo para un PC, es usable y se puede obviar. Los combates son bastante r\u00e1pidos, salvo cuando tratamos con los &#8220;jefes&#8221;, los cuales nos pueden llevar un buen rato para derrotar (alg\u00fan drag\u00f3n me ha llevado cerca de media hora) y, dado que es un mundo bastante abierto, puede suceder que llegues a una zona con un nivel bajo y los combates se vuelvan bastante complicados.<\/p>\n<p>Por \u00faltimo comentar que tambi\u00e9n tiene una opci\u00f3n de multijugador, aunque pr\u00e1cticamente no lo hemos usado&#8230; el modo de un jugador es lo que m\u00e1s hemos exprimido, as\u00ed que aqu\u00ed no puedo opinar especialmente si el Dragon Age Inquisition tiene un gran modo multijugador o no.<\/p>\n<p>Y pasamos a hablar de las variantes del juego. Por un lado tenemos la edici\u00f3n b\u00e1sica y la edici\u00f3n del coleccionista, las cuales son iguales salvo que la \u00faltima a\u00f1ade unos cuantos extras que podr\u00edamos considerar de atrezzo (monturas, algunas armas y la banda sonora del juego).<\/p>\n<h2>En cuanto a los inevitables DLCs tenemos los siguientes en el Dragon Age Inquisition:<\/h2>\n<ul>\n<li><strong>Fauces de Hakkon.<\/strong> La primera expansi\u00f3n de la historia como tal. Aqu\u00ed nos encontramos donde iremos encontrando la historia del \u00faltimo inquisidor antes de nosotros. Esta expansi\u00f3n empieza de una manera bastante aburrida que mejora un poco seg\u00fan va acerc\u00e1ndose a la trama final.<\/li>\n<li><strong>El descenso.<\/strong> Este DLC se centra totalmente en los enanos y en los caminos de las profundidades. Desde el momento en que lo comienzas te va atrapando y formaremos parte de una historia muy interesante con una final bastante extra\u00f1o. Sin duda que muy recomendable<\/li>\n<li><strong>Intruso.<\/strong> El \u00faltimo DLC y que puso punto y final al Dragon Age 3. Este es el verdadero final del juego y se sit\u00faa un par de a\u00f1os despu\u00e9s del final del juego. Aqu\u00ed nos iremos despidiendo de nuestros compa\u00f1eros y veremos explicado por fin que demonios ha pasado, como se hizo el Velo y un posible Dragon Age 4.<\/li>\n<li><strong>El emporio negro.<\/strong> S\u00ed, la vuelta del emporio negro del Dragon Age 2. Aqu\u00ed podremos encontrar objetos la mar de raros y a unos precios la mar de curiosos; adem\u00e1s de un tendero un tanto peculiar.<\/li>\n<li><strong>Armadura llamas de la inquisici\u00f3n,\u00a0armas llamas de la inquisici\u00f3n y\u00a0montura con armadura llamas de la inquisi\u00f3n.<\/strong> Como su nombre indica, equipaci\u00f3n monotem\u00e1tica.<\/li>\n<li><strong>Despojos de los qunari.<\/strong>\u00a0extras de los qunari<\/li>\n<li><strong>Despojos de los avvaritas:<\/strong> extras de los avvaritas<\/li>\n<li><strong>Multijugador: matadragones.<\/strong> Se a\u00f1ade al modo multijugador una serie de extras relacionados con los dragones y m\u00e1s personajes.<\/li>\n<li><strong>Multijugador: destrucci\u00f3n.<\/strong> M\u00e1s contenido al modo multijugador.<\/li>\n<\/ul>\n<p>Un \u00faltimo detalle. Antes de que saliera el Dragon Age Inquisition, lanzaron la web <a href=\"https:\/\/dragonagekeep.com\">Dragon Age Keep<\/a>, un sitio donde una vez logueado con tu cuenta de BioWare, puedes cambiar todas las decisiones del Dragon Age Origins, del 2 y finalmente del Inquisition (esto pas\u00f3 unos meses m\u00e1s tarde de salir el Inquisition). Gracias a esto no tienes porque rejugar de nuevo a los anteriores para ver determinadas repercusiones, o incluso, para jugar a los DLCs del Inquisition, ya que puedes ir variando tus decisiones y afrontar los DLCs con un contexto diferente.<\/p>\n<p><iframe  id=\"_ytid_90038\"  width=\"660\" height=\"371\"  data-origwidth=\"660\" data-origheight=\"371\"  src=\"https:\/\/www.youtube.com\/embed\/7_a6ZX6NflM?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=0&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=1&#038;fs=1&#038;playsinline=0&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"autoplay; encrypted-media\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/p>\n<p>Despu\u00e9s de jugarlo largo y tendido, de pasarlo y de disfrutarlo al m\u00e1ximo, creo que este es el mejor juego de toda la saga hasta ahora al menos. Un nivel de epicidad que roza lo sublime (exceptuando el final &#8220;est\u00e1ndar&#8221;), una larga historia, giros de gui\u00f3n, diversi\u00f3n y unos dragones-gatos la mar de impresionantes. Si tuviera que escoger un orden de prioridad entre la trilog\u00eda, ser\u00eda el tercero, el primero y finalmente el segundo.<\/p>\n<p>Si no lo hab\u00e9is jugado, \u00bfa qu\u00e9 esper\u00e1is para darle una oportunidad al Dragon Age Inquisition?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hace ya mucho mucho tiempo que empec\u00e9 a jugar a esta saga de BioWare, como pod\u00e9is comprobar al ver los art\u00edculos sobre el Dragon Age Origins y sobre el Dragon Age 2 y culmina con este Dragon Age Inquisition. Pues s\u00ed, siendo as\u00ed, ten\u00eda que jugar y terminar el Dragon Age Inquisition, es decir, el [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2397,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[872],"tags":[998,999,756,797],"jetpack_featured_media_url":"https:\/\/i2.wp.com\/karstieltopia.com\/wp-content\/uploads\/2016\/02\/DragonAgeInquisition.jpg?fit=1024%2C576","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Dragon Age Inquisition, \u00bfel definitivo? - Karstieltopia<\/title>\n<meta name=\"description\" content=\"Hace ya tiempo que el Dragon Age Inquisition se public\u00f3 y se convirti\u00f3, en mi opini\u00f3n, en el mejor Dragon Age de la saga.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Dragon Age Inquisition, \u00bfel definitivo? - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Hace ya tiempo que el Dragon Age Inquisition se public\u00f3 y se convirti\u00f3, en mi opini\u00f3n, en el mejor Dragon Age de la saga.\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2016-02-27T06:36:41+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-29T10:54:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/karstieltopia.com\/wp-content\/uploads\/2016\/02\/DragonAgeInquisition.jpg?fit=1024%2C576\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"576\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/#primaryimage\",\"inLanguage\":\"es\",\"url\":\"https:\/\/i2.wp.com\/karstieltopia.com\/wp-content\/uploads\/2016\/02\/DragonAgeInquisition.jpg?fit=1024%2C576\",\"width\":1024,\"height\":576,\"caption\":\"Dragon Age Inquisition\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/\",\"name\":\"Dragon Age Inquisition, \\u00bfel definitivo? - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/#primaryimage\"},\"datePublished\":\"2016-02-27T06:36:41+00:00\",\"dateModified\":\"2016-02-29T10:54:59+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"description\":\"Hace ya tiempo que el Dragon Age Inquisition se public\\u00f3 y se convirti\\u00f3, en mi opini\\u00f3n, en el mejor Dragon Age de la saga.\",\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-inquisition\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-qG","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1654"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=1654"}],"version-history":[{"count":10,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1654\/revisions"}],"predecessor-version":[{"id":2415,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1654\/revisions\/2415"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media\/2397"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=1654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=1654"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=1654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}