{"id":1263,"date":"2007-01-09T11:46:00","date_gmt":"2007-01-09T11:46:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2007\/01\/09\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/"},"modified":"2007-01-09T11:46:00","modified_gmt":"2007-01-09T11:46:00","slug":"de-las-consultoras-y-el-trabajo-informatico-en-espana","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/programacion\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/","title":{"rendered":"De las consultoras y el trabajo inform\u00e1tico en Espa\u00f1a"},"content":{"rendered":"<p>Todo inform\u00e1tico (y adyegados) conocemos lo que son las <strong>consultoras<\/strong>: <em>entes malignos con fomento al body-shopping, m\u00e1s conocidas como c\u00e1rnicas, lugares del infierno, sitio de explotaci\u00f3n, humillaci\u00f3n asegurada, petrificaci\u00f3n de la vida, etc., etc., etc.<\/em><\/p>\n<p>\u00bfCuales son los motivos para pensar \u00e9sto? Pues la verdad son varios, por ejemplo dir\u00e9 los siguientes:<\/p>\n<ol><\/p>\n<li><strong>Nula perspectiva de futuro.<\/strong> Rara es la consultora que no os dice que ten\u00e9is una gran carrera profesional en ella; que crecer\u00e9is con las responsabilidades e ir\u00e9is ascendiendo en ella. Bien, quitando el par de consultoras grandes en las cuales es cierto que se asciende (pero entregando la vida a cambio), es una gran mentira. Lo m\u00e1s posible es que entres y te quedes en el mismo puesto durante a\u00f1os y a\u00f1os y, si tienes suerte, ver\u00e1s como te suben el IPC cada a\u00f1o y sino, ni eso (por supuesto, se te exigir\u00e1 m\u00e1s y m\u00e1s a precio de coste; eso es una constante en la ecuaci\u00f3n)<\/li>\n<p><\/p>\n<li><strong>P\u00e9rdida de vida personal.<\/strong> Es bastante com\u00fan que las consultoras, para ser m\u00e1s competitivas, tiren de las horas <em>&#8220;voluntarias&#8221;<\/em> no remuneradas y, si eres de las personas que salen a su hora, posiblemente te encuentres pronto con una reuni\u00f3n con el jefecillo de turno dici\u00e9ndote que no te implicas en el proyecto y no te comprometes con la empresa&#8230; Eso s\u00ed, olv\u00eddate de que te paguen alguna vez esas horas extraordinarias.<\/li>\n<p><\/p>\n<li><strong>Humillaci\u00f3n constante.<\/strong> Aqu\u00ed depende un poco de donde est\u00e9s trabajando, pero es cierto que hay un porcentaje lo suficientemente elevado en los que pasa, sobre todo si est\u00e1s en tus primeros a\u00f1os. B\u00e1sicamente eres lo peor y quien se llevar\u00e1 las culpas de todo.<\/li>\n<p><\/p>\n<li><strong>Estancamiento profesional.<\/strong> Esta est\u00e1 ligada al primer punto. Como el cliente paga por ti, si haces tu curro correctamente&#8230; \u00bfpara que va a pagar m\u00e1s por ti? Pues ale, en los informes lo haces bien, pero tampoco es especialmente impresionante, con lo que ni pagan m\u00e1s por ti, ni asciendes ni naranjas de la china.<\/li>\n<p><\/p>\n<li><strong>P\u00e9rdida del af\u00e1n de trabajar.<\/strong> \u00c9sto es una consecuencia de todo lo anterior. Dudo que haya alg\u00fan profesional que no haya tenido una etapa (o toda una vida de trabajo) en la que ya no le motiva su trabajo. Es una causa com\u00fan en todos los aspecto de una vida: all\u00ed d\u00f3nde ah\u00ed un estancamiento, d\u00f3nde pasa el tiempo y no hay nada nuevo, implica una desmotivaci\u00f3n enorme. Y esta desmotivaci\u00f3n puede ser bastante destructiva.<\/li>\n<p><\/ol>\n<p>Pero, \u00bfy por qu\u00e9 si miro en el <a href=\"http:\/\/www.infojobs.net\/\">infojobs<\/a> o <a href=\"http:\/\/www.tecnoempleo.com\/\">tecnoempleo<\/a> (son las que yo miro) solo salen consultoras? Bueno amigo m\u00edo, es sencillo. Antes la gente con conocimiento inform\u00e1tico era un n\u00famero peque\u00f1o y coincidi\u00f3 esa escasez de trabajadores con las burbujas tecnol\u00f3gicas&#8230; Las empresas contrataban por unos sueldos astron\u00f3micos a la gente casi antes de acabar la carrera y todo pintaba muy bien&#8230; Pero lleg\u00f3 el gran tortazo, la explosi\u00f3n de la burbuja se llev\u00f3 a todo por delante.<\/p>\n<p>Consecuencia de \u00e9sto fue que las tecnol\u00f3gicas ya no quisieron contratar m\u00e1s gente, dado que el personal propio es motivo de muchos problemas. \u00c9ste fue el momento del declive, el gran <em>acontecimiento<\/em>&#8230;<\/p>\n<p>Ante este panorama, las consultoras llegaron y ofrecieron sus servicios: podemos proporcionaros personal, siempre estar\u00e1 dispuesto, no tendr\u00e9is problemas de quitar a la gente (no son sus empleados)&#8230; no tendr\u00e9is responsabilidades alguna&#8230; Y eso gust\u00f3 mucho, mucho, mucho.<\/p>\n<p>Desde entonces, es rara la empresa final que contrate a alguien. Todas prefieren personal externo f\u00e1cilmente manejable y sin regulaciones de empleo, ni sindicatos ni ninguna preocupaci\u00f3n. Podr\u00edamos pensar que entonces el conocimiento propio de la empresa se pierde y&#8230; acertaremos muchas veces. Lo curioso, es que no les importa, es algo obviable y que ser\u00e1 recuperado mediante horas no remuneradas por los nuevos del equipo de la consultora.<\/p>\n<p>Luego est\u00e1 tambi\u00e9n el tema de la bajada de costes. La empresa final quiere recortar costes, con lo que negocia con la consultora a la baja. Gracias a \u00e9sto, la consultora meter\u00e1 en el proyecto lo m\u00e1s bajo que tenga, es decir becarios o juniors y alg\u00fan senior o analista para la responsabilidad, vendi\u00e9ndolos al cliente como grandes expertos en todo o m\u00e1s (son innumerables las veces en que te dicen que mientas en la entrevista con el cliente, es m\u00e1s, tu curr\u00edculum se parecer\u00e1 tan poco al que enviaste a la consultora, que te preguntar\u00e1s si has sido abducido por alg\u00fan ente extraterrestre&#8230; \u00a1\u00a1Ah!!, esta es una de las razones por las que siempre te piden tu curr\u00edculum en formato Word&#8230; la otra es poder poner el sello de la empresa y que RRHH se ahorre el trabajo).<\/p>\n<p>Por cierto, si no lo hab\u00e9is notado, tal y como est\u00e1n las cosas \u00bfc\u00f3mo quieren que Espa\u00f1a sea un pa\u00eds con desarrollo tecnol\u00f3gico? Pues la verdad es que creo que no lo quieren. Somos un pa\u00eds sin innovaci\u00f3n, sin creaci\u00f3n de tecnolog\u00eda&#8230; Solo adaptamos productos de fuera y hacemos aplicaciones web en el 99% de los casos.<\/p>\n<p>Viendo todo \u00e9sto desde dentro, solo os puedo decir a los que veng\u00e1is que el panorama es muy desolador. Quiz\u00e1s con el tiempo el marco de trabajo vuelva a cambiar, o evolucione a otra cosa, pero actualmente no es lo que pens\u00e1bamos mientras estudi\u00e1bamos a\u00f1os y a\u00f1os.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Todo inform\u00e1tico (y adyegados) conocemos lo que son las consultoras: entes malignos con fomento al body-shopping, m\u00e1s conocidas como c\u00e1rnicas, lugares del infierno, sitio de explotaci\u00f3n, humillaci\u00f3n asegurada, petrificaci\u00f3n de la vida, etc., etc., etc. \u00bfCuales son los motivos para pensar \u00e9sto? Pues la verdad son varios, por ejemplo dir\u00e9 los siguientes: Nula perspectiva de [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[21],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>De las consultoras y el trabajo inform\u00e1tico en Espa\u00f1a - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/programacion\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"De las consultoras y el trabajo inform\u00e1tico en Espa\u00f1a - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Todo inform\u00e1tico (y adyegados) conocemos lo que son las consultoras: entes malignos con fomento al body-shopping, m\u00e1s conocidas como c\u00e1rnicas, lugares del infierno, sitio de explotaci\u00f3n, humillaci\u00f3n asegurada, petrificaci\u00f3n de la vida, etc., etc., etc. \u00bfCuales son los motivos para pensar \u00e9sto? Pues la verdad son varios, por ejemplo dir\u00e9 los siguientes: Nula perspectiva de [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/programacion\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2007-01-09T11:46:00+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/programacion\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/programacion\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/\",\"name\":\"De las consultoras y el trabajo inform\\u00e1tico en Espa\\u00f1a - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2007-01-09T11:46:00+00:00\",\"dateModified\":\"2007-01-09T11:46:00+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/programacion\/de-las-consultoras-y-el-trabajo-informatico-en-espana\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-kn","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1263"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=1263"}],"version-history":[{"count":0,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1263\/revisions"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=1263"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=1263"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=1263"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}