{"id":545,"date":"2010-03-26T13:42:00","date_gmt":"2010-03-26T13:42:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2010\/03\/26\/dragon-age-origins\/"},"modified":"2016-02-19T11:45:05","modified_gmt":"2016-02-19T11:45:05","slug":"dragon-age-origins","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/","title":{"rendered":"Dragon Age: Origins"},"content":{"rendered":"<p>Otro juego terminado para la saca (realmente cada vez juego menos pero&#8230; \u00a1menudos juegos! :D)<\/p>\n<div><a href=\"https:\/\/i1.wp.com\/3.bp.blogspot.com\/_rdepA3v4jNA\/S6y3iEQRf_I\/AAAAAAAAAKY\/v7dKFHEhiFs\/s1600-h\/dragon-age.png\" imageanchor=\"1\"><img loading=\"lazy\" border=\"0\" height=\"400\" src=\"https:\/\/i2.wp.com\/3.bp.blogspot.com\/_rdepA3v4jNA\/S6y3iEQRf_I\/AAAAAAAAAKY\/v7dKFHEhiFs\/s400\/dragon-age.png?resize=295%2C400\" width=\"295\"  data-recalc-dims=\"1\"><\/a><\/div>\n<p>Bien, como pod\u00e9is imaginar este juego me ha gustado. Es un juego de rol que dicen que es la actualizaci\u00f3n de Baldur&#8217;s Gate 2 a los tiempos modernos, pero quiz\u00e1s eso sea un pel\u00edn excesivo dado que hay un par de cosas que no le llegan a la altura, pero en l\u00edneas generales est\u00e1 genial.<\/p>\n<p>La historia del juego nos sit\u00faa justo al borde de una nueva Ruina, que no es m\u00e1s que el momento en el que los demonios deciden arrasar la tierra conocida; pero \u00e9sto ya ha pasado varias veces en la historia y por ello se crearon los Guardias Grises, que se dedican a vigilar y luchar contra los engendros tenebrosos que son la base de cada Ruina, adem\u00e1s de unir a los diferentes pueblos del mundo para luchar coordinadamente contra la Ruina.<\/p>\n<p>Ahora que llega una nueva acumulaci\u00f3n masiva de engendros tenebrosos, un nuevo ej\u00e9rcito se est\u00e1 organizando y t\u00fa eres uno de los reclutas.<\/p>\n<p>As\u00ed es como empezamos, pero podremos empezar de formas muy diferentes porque depender\u00e1 de la raza que elijas (humano, elfo o enano), de la clase que elijas (guerrero, p\u00edcaro o mago) y el trasfondo de tu vida. De esta manera nos situaremos en diferentes puntos del mundo y con diferentes trasfondos que influir\u00e1n en toda tu vida durante el juego.<\/p>\n<p>Y de esta manera nos encontramos con un juego de rol hecho y derecho, en d\u00f3nde iremos reclutando gente para nuestro equipo, los cu\u00e1les tienen fuertes personalidades y con los que ser\u00e1 posible hasta crear un romance (que por cierto, hay personajes heteros, bisexuales y asexuales con los que tener o no tener romances) o inclusive que te abandonen porque est\u00e1n muy desacuerdo con lo que haces. Por supuesto, como habr\u00e1 tan fuertes disparidades, habr\u00e1 momentos en que mantener en el mismo grupo a ciertos personajes sea muy dif\u00edcil y est\u00e9n todo el tiempo discutiendo entre ellos (\u00a1yupi! eso lo echaba mucho de menos del Baldur&#8217;s Gate :D).<\/p>\n<p>Voy a dividir un poco lo bueno y lo malo (en mi opini\u00f3n del juego):<\/p>\n<p><b>Cosas buenas<\/b>:<\/p>\n<ul>\n<li>Una historia bastante buena. Ciertamente la base es un t\u00f3pico, pero las diferentes historias que te vas encontrando, las propias historias de tus compa\u00f1eros y la forma en que todo se empieza a retorcer, hace que te metas bastante en el juego.<\/li>\n<li>Compa\u00f1eros de grupo con mucha personalidad. Alguno m\u00e1s que otro, pero en l\u00edneas generales tienen la suficiente personalidad como para que hablar con cualquiera de ellos te lleve un rato entretenido.<\/li>\n<li>Larga vida del juego. Tranquilamente unas 50 horas para tener el 50% del juego hecho.<\/li>\n<li>Combate estrat\u00e9gico. Y todo gracias a la pausa y a que las caracter\u00edsticas del personaje + armas &#038; armaduras + modificadores y habilidades son dr\u00e1sticamente importantes. <\/li>\n<\/ul>\n<p><b>Cosas malas<\/b> (porque no todo es bueno):<\/p>\n<ul>\n<li>Los combates. En este juego se han decidido a que la vida y el vigor\/mana se recupere r\u00e1pidamente cuando acabas una batalla, lo que implica que s\u00ed&#8230; han puesto mil combates, lo cu\u00e1l en mi opini\u00f3n, hace que pierda un poco la gracia el juego por momentos y te aburras de tanto cortar cabezas o incinerarlos xD<\/li>\n<li>El equipamiento. \u00c9sto ha llegado a mini estresarme&#8230; \u00bfes mejor un arma que te sube la fuerza +2 u otra que te sube el ataque u otra que te sube un porcentage? Lo mismo para armaduras y todo tipo de cosas&#8230; as\u00ed que al final te gu\u00edas por el precio, que suele ser un indicador bastante bueno. Y otra cosa del equipamiento es que es tirando a feo, sobre todo si no eres un guerrero. Vale, no es necesario ir a la moda, pero es que el equipamiento es casi igual para todos los oficios (por ejemplo, los magos son casi iguales) y leches, si te partes el lomo aniquilando todo, \u00a1por lo menos tener un buen y mol\u00f3n equipo! :P<\/li>\n<li>El carisma y actuaci\u00f3n del protagonista. \u00c9sto es un poco raro, pero por momentos te sientes m\u00e1s identificado con tus compa\u00f1eros que contigo mismo, y es que siempre parece que tu personaje es el m\u00e1s plano de todos y que no tienes muchas opciones a radicalizarte en la forma en que quieres proseguir. Y por otro lado, en los di\u00e1logos sueles tener muchas opciones \/ contestaciones pero&#8230; \u00bfpor qu\u00e9 todas suelen ser de pocas palabras? Hay veces que un parrafazo arreglar\u00eda el mundo :D<\/li>\n<li>La inteligencia de tus compa\u00f1eros. Resulta que se han inventado un sistema de reglas que en principio debiera cubrir toda las situaciones posibles y as\u00ed le dices cosas como, si tienes poca vida, haz \u00e9sto; si un compa\u00f1ero est\u00e1 rodeado, haz \u00e9sto otro&#8230; \u00a1Pero resulta que se ganan \u00f3rdenes gastando habilidades! As\u00ed que por defecto tienes personajes tirando a locos \/ tontos en batalla.<\/li>\n<\/ul>\n<p>En resumen, tard\u00e1is en jugar con \u00e9l, sobre todo si os gustan los juegos de rol. Y, como colof\u00f3n, os dejo un v\u00eddeo para vuestro disfrute :D<\/p>\n<div><\/div>\n<p><b>Pd.1.<\/b> Ya han sacado la expansi\u00f3n y puedes recuperar tu personaje&#8230; lo malo es que parece que tus compa\u00f1eros solo aparecer\u00e1n haciendo cameos y habr\u00e1 nueva\u00a0 gentecilla por ah\u00ed&#8230; Jopetas \u00ac_\u00ac<br \/><b>Pd.2.<\/b> \u00a1Drizzt! \u00bfA qu\u00e9 no sabes qui\u00e9n dobla a Morrigan (bruja del juego)? Pues&#8230; \u00a1Claudia Black!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Otro juego terminado para la saca (realmente cada vez juego menos pero&#8230; \u00a1menudos juegos! :D) Bien, como pod\u00e9is imaginar este juego me ha gustado. Es un juego de rol que dicen que es la actualizaci\u00f3n de Baldur&#8217;s Gate 2 a los tiempos modernos, pero quiz\u00e1s eso sea un pel\u00edn excesivo dado que hay un par [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[872],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Dragon Age: Origins - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Dragon Age: Origins - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Otro juego terminado para la saca (realmente cada vez juego menos pero&#8230; \u00a1menudos juegos! :D) Bien, como pod\u00e9is imaginar este juego me ha gustado. Es un juego de rol que dicen que es la actualizaci\u00f3n de Baldur&#8217;s Gate 2 a los tiempos modernos, pero quiz\u00e1s eso sea un pel\u00edn excesivo dado que hay un par [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2010-03-26T13:42:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-19T11:45:05+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/3.bp.blogspot.com\/_rdepA3v4jNA\/S6y3iEQRf_I\/AAAAAAAAAKY\/v7dKFHEhiFs\/s400\/dragon-age.png\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/#primaryimage\",\"inLanguage\":\"es\",\"url\":\"http:\/\/3.bp.blogspot.com\/_rdepA3v4jNA\/S6y3iEQRf_I\/AAAAAAAAAKY\/v7dKFHEhiFs\/s400\/dragon-age.png\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/\",\"name\":\"Dragon Age: Origins - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/#primaryimage\"},\"datePublished\":\"2010-03-26T13:42:00+00:00\",\"dateModified\":\"2016-02-19T11:45:05+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/ocio\/juegos\/dragon-age-origins\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-8N","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/545"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=545"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/545\/revisions"}],"predecessor-version":[{"id":1919,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/545\/revisions\/1919"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=545"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=545"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=545"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}