{"id":1221,"date":"2007-02-10T20:37:00","date_gmt":"2007-02-10T20:37:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2007\/02\/10\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/"},"modified":"2016-02-15T22:48:09","modified_gmt":"2016-02-15T22:48:09","slug":"lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/","title":{"rendered":"Lo dicho en la asamblea de la Universidad de Le\u00f3n sobre el futuro inform\u00e1tico espa\u00f1ol"},"content":{"rendered":"<p>Much\u00edsimas gracias a Auty que fue a dicha asamblea y nos ha realizado un buen reportaje sobre ello.<\/p>\n<p>Lo \u00fanico malo es que por lo visto asisti\u00f3 muy poca gente a dicha asamblea&#8230; una pena que no haya m\u00e1s gente implicada<\/p>\n<p>En fin, aqu\u00ed est\u00e1 el comentario de la asamblea:<\/p>\n<p>En rasgos generales, lo que va a hacer el tratado de Bolonia con las ingenier\u00edas, o m\u00e1s bien, lo que quiere hacer el gobierno interpretando a su manera el tratado de Bolonia (porque parece ser que cada pa\u00eds lo interpreta como le da la gana) es hacer dos bloques de ingenier\u00edas: las de primera categor\u00eda, y las de segunda.<\/p>\n<p>El criterio que va a seguir el estado para esto es que ser\u00e1n ingenier\u00edas de \u201cprimera divisi\u00f3n\u201d las que tengan profesi\u00f3n regulada, o sea, las ingenier\u00edas que dispongan de un colegio profesional a nivel nacional que las regule; y ser\u00e1n ingenier\u00edas \u201cde segunda\u201d las que no tengan profesi\u00f3n regulada.<\/p>\n<p>1\u00aa categor\u00eda: Industriales, Minas, Caminos, Teleco\u2026 ser\u00e1n las propiamente llamadas \u201cingenier\u00edas\u201d.<br \/>2\u00aa categor\u00eda: Inform\u00e1tica, Qu\u00edmica\u2026 no ser\u00e1n ingenier\u00edas, se inventar\u00e1n un t\u00edtulo para ellas.<\/p>\n<p>Las ingenier\u00edas de primera tendr\u00e1n lo que se llama \u201cdirectrices espec\u00edficas\u201d, que vienen a ser una serie de convenios que asumir\u00e1n por ley todas las universidades que impartan esas carreras, con lo cual, todas las universidades sacar\u00e1n a sus estudiantes con el t\u00edtulo de, por ejemplo, \u201cIngeniero de Minas\u201d.<\/p>\n<p>Las de segunda no tendr\u00e1n esas directrices, por lo que cada universidad podr\u00e1 elaborar el plan de estudios que le d\u00e9 la gana, con las asignaturas que quiera, con los a\u00f1os, especializaciones, etc que se le antojen, y esto, evidentemente, no dar\u00e1 lugar a titulados de la misma carrera, sino lo que se vendr\u00e1 a denominar como: \u201cGraduado en ingenier\u00eda y arquitectura de: \u2013nombre de la carrera que se invente cada universidad\u2013 por la Universidad de tal\u201d.<\/p>\n<p>Con lo cual, en lo que nos ocupa, la ingenier\u00eda inform\u00e1tica ya habr\u00e1 dejado de existir, porque por todo el pa\u00eds habr\u00e1 graduados en \u201cSistemas de informaci\u00f3n por la uni de Le\u00f3n\u201d, \u201cTecnolog\u00eda de las comunicaciones por la uni de Oviedo\u201d, \u201cInform\u00e1tica y nuevas tecnolog\u00edas por la uni de Valladolid\u201d\u2026 etc etc etc. Esto es: desaparecer\u00e1 la ingenier\u00eda inform\u00e1tica como cuerpo compacto, e incluso el mero concepto de \u201cinform\u00e1tico\u201d (trabajador en inform\u00e1tica).<\/p>\n<p>Parece ser que todo este desplante y ninguneo descarado lo hacen porque la inform\u00e1tica actualmente constituye el 3,4% del PIB, y aprovechando que ahora todav\u00eda los inform\u00e1ticos no tienen ning\u00fan tipo de competencia regulada, ni una presencia como cuerpo con identidad propia en nuestro pa\u00eds, todas las ingenier\u00edas que puedan van a intentar pillar cacho de ese porcentaje de pastel del PIB que pertenece a temas inform\u00e1ticos.<\/p>\n<p>Lo que m\u00e1s juega en nuestra contra es que inform\u00e1tica no tiene ninguna presencia en los ministerios de los que depende. Para hablar claro: todos los jefes, subjefes, y superjefes de todos los ministerios que tienen que ver con telecomunicaciones, nuevas tecnolog\u00edas, sistemas de informaci\u00f3n, etc, son telecos (enti\u00e9ndase \u201ctelecos\u201d no como despectivo, sino como abreviatura). Y por supuesto, lo quieren seguir siendo, y quieren que los que vengan detr\u00e1s de ellos contin\u00faen siendo telecos.<\/p>\n<p>Como ejemplo concreto tenemos que en la Junta de Castilla y Le\u00f3n, inform\u00e1tica depende de la Direcci\u00f3n General de Telecomunicaciones. En ese entorno se da cabida unos 400 trabajadores, de entre los cuales 350 son inform\u00e1ticos y 50 son telecos. Ni qu\u00e9 decir tiene que absolutamente toda la directiva de esta entidad est\u00e1 formada \u00edntegramente por telecos.<\/p>\n<p>Tan desesperados est\u00e1n porque inform\u00e1tica no llegue a tomar conciencia como cuerpo independiente (como Skynet) que en todas las conferencias que dan sobre el tema estos dirigentes, jam\u00e1s mencionan la palabra \u201cinform\u00e1tica\u201d, sino que se van por las ramas diciendo \u201ctecnolog\u00edas de la informaci\u00f3n\u201d, \u201csistemas electr\u00f3nicos\u201d o cualquier cosa que se les ocurra. Y si se les pregunta acerca de ello dicen que la inform\u00e1tica no es tan importante, que la electr\u00f3nica s\u00ed, porque es lo que soporta todo, pero que la inform\u00e1tica es algo accesorio.<\/p>\n<p>Ahora viene la cuesti\u00f3n: \u00bfen qu\u00e9 nos afectar\u00e1 en la pr\u00e1ctica que esto se lleve a cabo?<\/p>\n<p>En primer lugar, que lo que est\u00e1 mal ahora, seguir\u00e1 estando mal. El trabajo en la administraci\u00f3n p\u00fablica seguir\u00e1 teniendo el intrusismo laboral brutal que tenemos hoy d\u00eda (un inform\u00e1tico no puede presentarse a unas oposiciones de medicina, ni de derecho, \u00bfpor qu\u00e9 un fil\u00f3logo, un historiador, o cualquiera, puede presentarse a unas oposiciones de inform\u00e1tica?).<\/p>\n<p>Pero aparte, en un futuro, cuando se apruebe esta medida, tendremos los siguientes inconvenientes:<br \/>-Conforme pasen los a\u00f1os y evolucione la ley de protecci\u00f3n de datos, se har\u00e1 necesario auditar los sistemas inform\u00e1ticos, habr\u00e1 que proporcionar asesoramiento t\u00e9cnico en los juicios que tengan algo que ver con delitos inform\u00e1ticos. \u00bfQui\u00e9nes ser\u00e1n los expertos que ocupen esos puestos? Los inform\u00e1ticos no pueden ser, porque no son un cuerpo y no han recibido una misma formaci\u00f3n, se lo llevar\u00e1 el cuerpo de ingenieros \u201cque m\u00e1s se parezca\u201d a lo que tiene que ver con la inform\u00e1tica, esto es: los telecos.<br \/>-Cuando ya se haya cumplido esta reforma, las empresas y empleadores varios, cuando uno les presente su graduado en inform\u00e1tica (o el nombre raro que hayan querido poner) no sabr\u00e1n lo que realmente ha estudiado, ni qu\u00e9 tipo de formaci\u00f3n tiene, eso supone que no sabes qu\u00e9 tipo de empleado vas a contratar.<br \/>-Otra consecuencia un poco m\u00e1s pol\u00edtica, aunque igualmente pr\u00e1ctica, es que al ser cada graduado en \u201cla carrera anteriormente conocida como inform\u00e1tica\u201d con un plan de estudios diferente en cada provincia y comunidad, favorecer\u00e1 los nacionalismos o localismos, de manera que una empresa puede decir que el perfil que busca es el de todos los graduados en inform\u00e1tica de Bizkaia, porque es el \u00fanico plan de estudios que se ajusta realmente a sus necesidades bla bla bla, y cerrar el grifo al resto del pa\u00eds (y creo que todos sabemos que hay ciertas comunidades que SEGURO lo van a hacer).<br \/>-Tambi\u00e9n cabe destacar que los ingenieros inform\u00e1ticos que hayan conseguido su t\u00edtulo antes de esta reforma, como despu\u00e9s de ella NO EXISTIR\u00c1 la ingenier\u00eda inform\u00e1tica (no es que haya cambiado de nombre, o haya sido reformada, simplemente no existir\u00e1) no podr\u00e1n convalidar ni homologar su t\u00edtulo a ninguno de los existentes, ni siquiera a los graduados raros de cada universidad, precisamente porque todos ser\u00e1n distintos y no habr\u00e1 nada regulado. As\u00ed que tendr\u00e1n un t\u00edtulo obsoleto y no s\u00e9 qu\u00e9 pensar\u00e1 hacer el gobierno con ellos.<\/p>\n<p>As\u00ed que todo esto pasar\u00e1 porque la ingenier\u00eda inform\u00e1tica no es una profesi\u00f3n regulada, o sea, no tiene un colegio general profesional. Pero, lo gracioso es que en realidad inform\u00e1tica s\u00ed deber\u00eda ser una profesi\u00f3n regulada, porque tiene muchos colegios profesionales locales, y la ley dice que cuando una profesi\u00f3n disponga de 2 colegios locales, se crear\u00e1 un colegio profesional general que los regule a nivel nacional. \u00bfPor qu\u00e9 no se ha creado el colegio general? simplemente porque el gobierno (o los jefes telecos de los organismos\/ministerios de nuevas tecnolog\u00edas) no quieren cumplir la ley, porque si lo hicieran tendr\u00edan que reconocer que la ingenier\u00eda inform\u00e1tica es un cuerpo homog\u00e9neo y dispone de una profesi\u00f3n regulada, con lo cual, tendr\u00edan que darnos atribuciones y derechos que, en un futuro pr\u00f3ximo, SI NO CUMPLEN LA LEY, se los llevar\u00e1n ellos.<\/p>\n<p>La cosa es muy simple: la \u00fanica raz\u00f3n por la que no nos quieren conceder lo que nos corresponder\u00eda por l\u00f3gica (y por ley) es porque de no conced\u00e9rnoslo, se lo llevar\u00edan ellos. \u00bfY por qu\u00e9 en este caso es tan dif\u00edcil hacer cumplir la ley (y la l\u00f3gica)? Porque la gente que no quiere que se cumpla la ley est\u00e1 metida en altos puestos del gobierno y los ministerios.<\/p>\n<p>Lo mejor de todo es que el gobierno para calmarnos lo que nos dice es que nos tranquilicemos, \u201cporque no vamos a perder ning\u00fan derecho ni nos van a quitar nada\u201d. Cosa cierta, porque ahora no tenemos ning\u00fan derecho ni absolutamente nada. Lo que nosotros queremos, es que se reconozca que la ingenier\u00eda inform\u00e1tica tiene la misma importancia que el resto, que es una INGENIER\u00cdA por derecho propio, porque es la primera ingenier\u00eda en Espa\u00f1a en n\u00famero de alumnos y escuelas, y la segunda en n\u00famero de profesionales, y que los trabajos de inform\u00e1tica los tiene que desempe\u00f1ar un inform\u00e1tico de profesi\u00f3n, no cualquier persona de cualquier carrera que tenga suficiente cabeza como para empollar unas oposiciones.<\/p>\n<p>Una cosa muy interesante es que en toda Europa existe la carrera de INGENIER\u00cdA inform\u00e1tica (la que en Espa\u00f1a pretenden quitar) y en ning\u00fan pa\u00eds europeo salvo Espa\u00f1a (y no s\u00e9 si Francia tambi\u00e9n) existe la carrera de Telecomunicaciones. Por tanto\u2026 \u00bfBolonia no era para asegurar la homogeneidad de carreras y la total compatibilidad y movilidad de los estudiantes y trabajadores dentro de la comunidad europea? \u00bfentonces no ser\u00eda lo suyo que una carrera que existe en el resto de europa la mantuvi\u00e9ramos en Espa\u00f1a?. Porque, con la reforma, los nuevos graduados en lo \u201canteriormente conocido como inform\u00e1tica\u201d no podr\u00e1n moverse por europa ni como estudiantes ni como profesionales.<\/p>\n<p>Entre todo este batiburrillo, una de las propuestas del gobierno para asegurar el futuro de la inform\u00e1tica en Espa\u00f1a, es transformarla en un m\u00e1ster de Telecomunicaciones, argumentando que Teleco \u201ces la que tiene m\u00e1s de 80 a\u00f1os de historia en Espa\u00f1a\u201d; O sea, quieren transformar una carrera con gran importancia y tradici\u00f3n en toda Europa (y demostrada importancia en Espa\u00f1a) en un simple a\u00f1adido de una carrera inexistente en Europa.<\/p>\n<p>De momento el gobierno s\u00f3lo se ha atrevido a hacer propuestas, pero la ministra parece ser que est\u00e1 empe\u00f1ada<br \/> en que esto se empiece a poner en pr\u00e1ctica lo m\u00e1s pronto posible, incluso se baraja la posibilidad de que el curso que viene algunas universidades empiecen a actuar ya como si estuviera todo aprobado, como experimentos piloto, a la par que una medida de presi\u00f3n. De momento, como digo, no se ha aprobado nada vinculante al respecto, pero en el momento en el que se elabore y apruebe un Real Decreto, ya, por mucho que nos movamos, por mucho que hagamos o que protestemos, no habr\u00e1 marcha atr\u00e1s.<\/p>\n<p align=\"center\"><img loading=\"lazy\" width=\"468\" height=\"60\" title=\"Eres Ingeniero\" alt=\"Eres Ingeniero\" src=\"https:\/\/i1.wp.com\/i967.photobucket.com\/albums\/ae156\/pongaunagujeronegroensuvida\/blog\/banner2.gif?resize=468%2C60\" data-recalc-dims=\"1\"><\/p>\n<p><strong>M\u00e1s informaci\u00f3n:<\/strong><br \/>http:\/\/www.pongaunagujeronegroensuvida.es\/2007\/02\/06\/asamblea-en-la-universidad-de-leon\/<br \/>http:\/\/www.ingenierosdeprimera.com\/node\/340<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Much\u00edsimas gracias a Auty que fue a dicha asamblea y nos ha realizado un buen reportaje sobre ello. Lo \u00fanico malo es que por lo visto asisti\u00f3 muy poca gente a dicha asamblea&#8230; una pena que no haya m\u00e1s gente implicada En fin, aqu\u00ed est\u00e1 el comentario de la asamblea: En rasgos generales, lo que [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[21],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Lo dicho en la asamblea de la Universidad de Le\u00f3n sobre el futuro inform\u00e1tico espa\u00f1ol - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Lo dicho en la asamblea de la Universidad de Le\u00f3n sobre el futuro inform\u00e1tico espa\u00f1ol - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Much\u00edsimas gracias a Auty que fue a dicha asamblea y nos ha realizado un buen reportaje sobre ello. Lo \u00fanico malo es que por lo visto asisti\u00f3 muy poca gente a dicha asamblea&#8230; una pena que no haya m\u00e1s gente implicada En fin, aqu\u00ed est\u00e1 el comentario de la asamblea: En rasgos generales, lo que [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2007-02-10T20:37:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-15T22:48:09+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/i967.photobucket.com\/albums\/ae156\/pongaunagujeronegroensuvida\/blog\/banner2.gif\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/#primaryimage\",\"inLanguage\":\"es\",\"url\":\"http:\/\/i967.photobucket.com\/albums\/ae156\/pongaunagujeronegroensuvida\/blog\/banner2.gif\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/\",\"name\":\"Lo dicho en la asamblea de la Universidad de Le\\u00f3n sobre el futuro inform\\u00e1tico espa\\u00f1ol - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/#primaryimage\"},\"datePublished\":\"2007-02-10T20:37:00+00:00\",\"dateModified\":\"2016-02-15T22:48:09+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/programacion\/lo-dicho-en-la-asamblea-de-la-universidad-de-leon-sobre-el-futuro-informatico-espanol\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-jH","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1221"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=1221"}],"version-history":[{"count":3,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1221\/revisions"}],"predecessor-version":[{"id":1913,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1221\/revisions\/1913"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=1221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=1221"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=1221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}