{"id":669,"date":"2009-04-14T01:17:00","date_gmt":"2009-04-14T01:17:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2009\/04\/14\/el-desastre-de-faunia\/"},"modified":"2009-04-14T01:17:00","modified_gmt":"2009-04-14T01:17:00","slug":"el-desastre-de-faunia","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/trastero\/el-desastre-de-faunia\/","title":{"rendered":"El desastre de Faunia"},"content":{"rendered":"<p>En esta Semana Santa decidimos ver animales que no se ven todos los d\u00edas y como hab\u00edamos visitado ya el zoo de Madrid, pues la opci\u00f3n de Faunia se present\u00f3 delante de nosotros.<\/p>\n<p>Al principio era solo una opci\u00f3n, porque el alto, alto, alto precio echaba mucho para atr\u00e1s (casi 25 \u20ac por cabeza) pero bueno, si la calidad estaba a la par del precio (creo recordar que el zoo vale la mitad m\u00e1s o menos) y lo que dec\u00edan de que era una forma diferente de ver un zoo se cumpl\u00eda, podr\u00eda merecer la pena.<\/p>\n<p>Lo primero, como no, era echar un vistazo a su p\u00e1gina web&#8230; Primera opini\u00f3n mala. Una p\u00e1gina web basada totalmente en flash (y para colmo que abre otra web y algunos sab\u00e9is que es algo que yo detesto) y encima no muestra casi nada de informaci\u00f3n, s\u00f3lo muchos sonidos e im\u00e1genes grandilocuentes&#8230; Bueno, mal gusto lo podemos tener todos, as\u00ed que a mirar opiniones por ah\u00ed. Todos coincid\u00edan en que el precio era bastante elevado (leches, y s\u00f3lo hay que ver como lo han ido hinchando a\u00f1o tras a\u00f1o) pero que merec\u00eda la pena&#8230;<\/p>\n<p>As\u00ed que nada, reflex a la espalda, varios objetivos, alg\u00fan sandwich (malditas barras de pan que se destruyen a las pocas horas de vida \u00ac\u00ac) y al ataque.<\/p>\n<p>Llegamos en metro, despu\u00e9s de una peque\u00f1a caminata, y ah\u00ed hab\u00eda unas colas enormes. Primera curiosidad mala: resulta que hay un plano del parque, pero cuesta 60 c\u00e9ntimos&#8230; Errr, \u00bfc\u00f3mo que me van a cobrar por un cacho de hoja mal puesto con un plano que parece hecho por un ni\u00f1o y en cambio me dan un panfleto de todas las ventajas que tiene hacerse socio por un a\u00f1o?<\/p>\n<p>Mal&#8230; bueno, entramos. Nos escapamos milagrosamente de una persona que te empuja contra unos ping\u00fcinos de madera o pl\u00e1stico o algo as\u00ed, y te hace una foto a la fuerza qu\u00e9 despu\u00e9s puedes comprar por un m\u00f3dico precio de \u00a1\u00a15 euros!! Y lo gracioso es que, cuando salimos, hab\u00eda una gran cola esperando por esas fotos O_O !!!!!<\/p>\n<p>Bien, avanzamos un poco m\u00e1s y&#8230; peor todav\u00eda&#8230; \u00a1\u00a1\u00a1se nos mete a la fuerza en la tienda del recinto!!! Arrrgggg, suerte que siempre se puede esquivar de mala manera y avanzar para&#8230; \u00a1\u00a1entrar en la zona grande de restaurantes!! Porque s\u00ed, hay m\u00e1s restaurantes que zonas de animales. Pufff, mal, mal, mal&#8230;<\/p>\n<p>Avanzamos un poco y empezamos a ver animalitos en un peque\u00f1o lago y en los que hay, casualmente,\u00a0 un mont\u00f3n de gente echando comida a dichos animalitos&#8230; Y m\u00e1s curiosamente detr\u00e1s de ellos hay unas m\u00e1quinas expendedoras de comida por otro m\u00f3dico precio de 60 c\u00e9ntimos&#8230;<\/p>\n<p>Y por si no ha sido poco, detr\u00e1s de eso, podemos ver unos graciosos perros de la pradera gru\u00f1endo por la mala leche que est\u00e1n acumulando al ver como los ni\u00f1os los persiguen y, claro est\u00e1, tambi\u00e9n tienen su m\u00e1quina expendedora de aut\u00e9ntica comida molona para ellos&#8230; Puffff<\/p>\n<p>Pero bueno, miramos horarios y, leches, tocaba en ese momento la exhibici\u00f3n de animales marinos&#8230; Vamos corriendo y vemos que es un anfiteatro con no muy buena visualizaci\u00f3n debido a las columnas, pero pasable. Esperamos a que empiece mientras se llena y vemos que hay carteles por doquier diciendo que no se puede ni comer ni ponerse de pie, pero vemos que la gente viene de los restaurantes con la comida en la mano&#8230; Por cierto, \u00bfsab\u00e9is que hab\u00eda en el centro? Un &#8220;gracioso&#8221; cartel diciendo que si quer\u00edas una foto inolvidable con un animal marino, solo te costar\u00eda 8 euros&#8230;<\/p>\n<p>Bueno, empieza la exhibici\u00f3n con un ente humanil argentino saliendo a gritar a pleno pulm\u00f3n (creo que me qued\u00e9 varios minutos sordo totalmente) con un &#8220;\u00bfc\u00f3mo est\u00e1n ustedes?&#8221;&#8230; Errr, \u00bf\u00bfhola?? \u00bfD\u00f3nde estamos? Y empieza a decir cosas obvias y sacan a un par de animalicos a hacer las t\u00edpicas tonter\u00edas y se acab\u00f3&#8230; Pr\u00e1cticamente nada.<\/p>\n<p>En fin, continuamos con una riada de gente golpe\u00e1ndonos y arrastr\u00e1ndonos (porque claro, los accesos al anfiteatro son un aut\u00e9ntico cuello de botella) y nos ponemos a comer en un banco mientras vemos como los ni\u00f1os persiguen a m\u00e1s aves acu\u00e1ticas&#8230; \u00bfPero como les pueden dejar hacer eso? O_O<\/p>\n<p>Resulta que en Faunia se enorgullecen de que tienen \u00e1reas tem\u00e1ticas en las que puedes ver los animales en algo parecido a su habitat mientras tu &#8220;alucinas&#8221; Bien, fuimos a ver a los animales nocturnos y s\u00ed, alucinamos&#8230; Pasamos del exterior con una luz total, a la ausencia total de luz, sin un instante para acostumbrar al ojo al cambio&#8230; Vamos a ver, \u00bfc\u00f3mo demonios hacen semjante burrada? \u00bfNo saben que el ojo humano necesita bastantes segundos en acostumbrarse a pasar de luz a oscuridad? Pues parece que no&#8230; Y claro, \u00bfqu\u00e9 pasa cuando hacen ese cambio\u00a0 y ponen directamente a los animales en la primera esquina que est\u00e1 a dos metros? Pues que la gente no para de chocar y golpearse porque no ve que demonios tiene delante&#8230;<\/p>\n<p>A partir de aqu\u00ed las cosas empiezan a degradarse, as\u00ed que pasar\u00e9 a resumirlo. Pocos animales, las aves bastante mal cuidadas (a muchas cotorras se las ve\u00eda como se arrancaban las plumas y estaban casi sin plumas en gran parte del cuerpo), muchos animales eran tocados sin ning\u00fan tipo de remordimiento ni impedimento por la gente que pasaba y unos h\u00e1bitats cuestionables.<\/p>\n<p>Todo \u00e9sto al tiempo que se ve\u00edan carteles con cosas como &#8220;celebra tu xxxxx&#8221;, &#8220;\u00bfquieres pasar una aventura?&#8221;, etc y voces de fondo diciendo cosas como&#8230; &#8220;Ahora que llevas un buen rato andando, \u00bfno te apatecer\u00eda un buen bocata en xxxxxxxx?&#8221; Es decir, un ataque brutal y desconsiderado de auto publicidad.<\/p>\n<p>Y vamos, la secci\u00f3n del jur\u00e1sico, ten\u00eda m\u00e1s monstruos de pel\u00edculas que dinosaurios y, leches, casi ocupaba el mismo espacio la reproduci\u00f3n de parque jur\u00e1sico en una televisi\u00f3n de tubo la mar de fea.<\/p>\n<p>Para mi solo se salvaron un par de cosas: la exhibici\u00f3n de las rapaces no estuvo mal (aunque demonios, los comentarios del presentador eran nefastos, como decir que los buitres representaban la muerte&#8230; diox&#8230; \u00bf\u00bf\u00bfc\u00f3mo demonios esperan que la gente respete a los animales con semejantes comentarios???), los ping\u00fcinos eran graciosos (aunque todos llevaban una especie de correa en un ala y uno de ellos era incapaz de bajarla y parec\u00eda bastante inc\u00f3modo) y los manat\u00edes, que no se ven todos los d\u00edas (aunque creo que d\u00f3nde estaban no era el mejor sitio y era excesivamente peque\u00f1o y relleno de peces gato para estar agusto)&#8230;<\/p>\n<p>Ah, por si no lo hab\u00edais imagina, para poder salir del parque, la \u00fanica forma era atravesar la tienda tambi\u00e9n&#8230; la cu\u00e1l segu\u00eda perfectamente abierta aun cuando hab\u00eda &#8220;cerrado&#8221; el parque.<\/p>\n<p>En resumen, si me pregunt\u00e1is por mi opini\u00f3n, queda bastante clara cual es: una aut\u00e9ntica estafa; un lugar completamente no recomendable y extremadamente caro, en el que la publicidad es exagerada (demonios, hasta los coches que ten\u00edan ellos llevaban publicidad de si quer\u00edan utilizar animales para el cine o publicidad) y en el que parece que lo que se quiere ense\u00f1ar es que los animales son juguetes sujetos a nuestros caprichos&#8230;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>En esta Semana Santa decidimos ver animales que no se ven todos los d\u00edas y como hab\u00edamos visitado ya el zoo de Madrid, pues la opci\u00f3n de Faunia se present\u00f3 delante de nosotros. Al principio era solo una opci\u00f3n, porque el alto, alto, alto precio echaba mucho para atr\u00e1s (casi 25 \u20ac por cabeza) pero [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[873],"tags":[344,345],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>El desastre de Faunia - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/trastero\/el-desastre-de-faunia\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"El desastre de Faunia - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"En esta Semana Santa decidimos ver animales que no se ven todos los d\u00edas y como hab\u00edamos visitado ya el zoo de Madrid, pues la opci\u00f3n de Faunia se present\u00f3 delante de nosotros. Al principio era solo una opci\u00f3n, porque el alto, alto, alto precio echaba mucho para atr\u00e1s (casi 25 \u20ac por cabeza) pero [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/trastero\/el-desastre-de-faunia\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2009-04-14T01:17:00+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/trastero\/el-desastre-de-faunia\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/trastero\/el-desastre-de-faunia\/\",\"name\":\"El desastre de Faunia - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2009-04-14T01:17:00+00:00\",\"dateModified\":\"2009-04-14T01:17:00+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/trastero\/el-desastre-de-faunia\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-aN","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/669"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=669"}],"version-history":[{"count":0,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/669\/revisions"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=669"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=669"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=669"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}