{"id":811,"date":"2008-07-07T02:54:00","date_gmt":"2008-07-07T02:54:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2008\/07\/07\/mirando-un-pliego-de-condiciones\/"},"modified":"2016-02-25T15:57:48","modified_gmt":"2016-02-25T14:57:48","slug":"mirando-un-pliego-de-condiciones","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/programacion\/trabajo\/mirando-un-pliego-de-condiciones\/","title":{"rendered":"Mirando un pliego de condiciones"},"content":{"rendered":"<p>Leyendo esta entrada de eBierzo, he visto que han sacado a concurso p\u00fablico una nueva web para el ayuntamiento de Ponferrada, la cu\u00e1l debe tener todas esas cosas de la web 2.0 a las que estamos tan acostumbrados \u00faltimamente.<\/p>\n<p>Sin embargo no he podido resistirme a tirar por aqu\u00ed un par de l\u00edneas&#8230;<\/p>\n<p>Lo qu\u00e9 se pide m\u00e1s o menos es lo siguiente:<\/p>\n<p><em>El uso de un CMS, arquitectura en Java, l\u00f3gica en Java \u00f3 .Net por otro (me hace gracia lo de .Net cuando previamente se menciona en otro punto Java para que sea multiplataforma), que cumpla est\u00e1ndares, que pueda validar todas las cosas guays tipo carnet electr\u00f3nico, que permita el acceso desde cual tipo de dispositivo, que use ciertas tecnolog\u00edas, que sea accesible, que permita usar m\u00faltiples tipos de documentos como pdfs, flash, etc, que sea multilenguaje, que se migre la anterior web, que los ciudadanos puedan participar, que se suministre la infraestructura necesaria, etc..<\/em><\/p>\n<p><\/p>\n<p><em>Y para ello se ofrecen 130.000\u20ac, 6 meses de tiempo para la entrega, as\u00ed como el requisito de que se hayan realizado tres proyectos p\u00fablicos anteriormente.<\/em><\/p>\n<p>Despu\u00e9s de leer \u00e9sto, tengo las siguientes reflexiones:<\/p>\n<ol><\/p>\n<li>Conociendo como es Ponferrada, el Bierzo, Le\u00f3n, dir\u00eda que ninguna empresa de las afincadas all\u00ed podr\u00e1 hacerse con el proyecto, dado que dudo mucho que cumplan los requisitos pedidos y que realmente puedan llevar a cabo dicho proyecto. Con \u00e9sto digo que, quiz\u00e1s, se deber\u00eda potenciar un poco m\u00e1s la zona y relajando requisitos y favoreciendo a lo cercano.<\/li>\n<p><\/p>\n<li>Relacionado con la anterior, me estoy imaginando que tipo de empresas van a intentar ganar el concurso, y hasta creo que estar\u00e1 una de mis antiguas empresas (m\u00e1s que nada porque tienen una sede en Valladolid intentando pillar todo los sorteos p\u00fablicos que puedan) y ser\u00eda muy gracioso, porque cu\u00e1ndo estuve en ella tambi\u00e9n ganaron un concurso, y me pusieron como analista del proyecto porque se ped\u00eda en uno de los requisitos que usase struts y yo hab\u00eda hecho un cursillo de teleformaci\u00f3n de 30 horas sobre eso&#8230; En fin, experiencia contrastada en Struts total xDDDDD<\/li>\n<p><\/p>\n<li>El tiempo de ejecuci\u00f3n me parece corto, por no decir muy corto. Si os ojeais el pliego de condiciones, la adaptaci\u00f3n del CMS que se vaya a utilizar es muy grande, adem\u00e1s de un mont\u00f3n de cosas que se piden y, para hacerlo con una cierta calidad y con una fase de testing adecuada, creo que yo dir\u00eda casi el doble de tiempo.<br \/>Aunque a la par, ya sab\u00e9is lo que dicen casi todos los managers con estas cosas: no os preocup\u00e9is, con que haya algo que entregar, vale&#8230; Luego ya le meteremos lo que falta y lo que no funciona en la fase de mantenimiento y as\u00ed, tambi\u00e9n cobraremos m\u00e1s&#8230;<\/li>\n<p><\/p>\n<li>Y luego pensando ya en temas econ\u00f3micos, si realmente se intenta hacer en ese tiempo, habr\u00e1 que tener un cierto grupo trabajando. Si echamos cuentas veremos que 130000 \/ 6 = 21667\u20ac mensuales destinados a pagar a los empleados y al estado (suponiendo un beneficio de 0\u20ac). Si ponemos un grupo a trabajar, si ponemos adem\u00e1s los beneficios que querr\u00e1 tener la empresa (cosa normal por otra parte), descontamos lo que corresponde a facturas y dem\u00e1s de la propia empresa, sumamos el hardware y servicios que tenga que comprar, y ponemos al final lo que tenga que ganar cada empleado (y lo que se paga al estado por el mismo, claro), tenemos una verdad absoluta: los becarios (v\u00e9ase tambi\u00e9n otras personillas que no se vienen a los mandriles y son explotados vilmente) pondr\u00e1n su mano inocente a picar como desesperados.<\/li>\n<p><\/ol>\n<p>Resumiendo, creo que es poco dinero y sobretodo, poco tiempo para ejecutarlo y esperar tener un producto de calidad y con toda la funcionalidad pedida&#8230; \u00bfQu\u00e9 os parece a vosotros?<\/p>\n<p><strong>Pd.<\/strong> \u00bfPor qu\u00e9 les gusta tanto poner siglas como posesos? \u00bfQui\u00e9n invent\u00f3 las malditas siglas? Al final hablaremos sin palabras completas&#8230;<\/p>\n<p><strong>V\u00eda:<\/strong> eBierzo || <strong>Pliego de condiciones:<\/strong> aqu\u00ed<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Leyendo esta entrada de eBierzo, he visto que han sacado a concurso p\u00fablico una nueva web para el ayuntamiento de Ponferrada, la cu\u00e1l debe tener todas esas cosas de la web 2.0 a las que estamos tan acostumbrados \u00faltimamente. Sin embargo no he podido resistirme a tirar por aqu\u00ed un par de l\u00edneas&#8230; Lo qu\u00e9 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[922],"tags":[365,559],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Mirando un pliego de condiciones - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/programacion\/trabajo\/mirando-un-pliego-de-condiciones\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Mirando un pliego de condiciones - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Leyendo esta entrada de eBierzo, he visto que han sacado a concurso p\u00fablico una nueva web para el ayuntamiento de Ponferrada, la cu\u00e1l debe tener todas esas cosas de la web 2.0 a las que estamos tan acostumbrados \u00faltimamente. Sin embargo no he podido resistirme a tirar por aqu\u00ed un par de l\u00edneas&#8230; Lo qu\u00e9 [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/programacion\/trabajo\/mirando-un-pliego-de-condiciones\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2008-07-07T02:54:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-25T14:57:48+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/programacion\/trabajo\/mirando-un-pliego-de-condiciones\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/programacion\/trabajo\/mirando-un-pliego-de-condiciones\/\",\"name\":\"Mirando un pliego de condiciones - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2008-07-07T02:54:00+00:00\",\"dateModified\":\"2016-02-25T14:57:48+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/programacion\/trabajo\/mirando-un-pliego-de-condiciones\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-d5","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/811"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=811"}],"version-history":[{"count":2,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/811\/revisions"}],"predecessor-version":[{"id":2384,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/811\/revisions\/2384"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=811"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}