{"id":301,"date":"2013-08-18T08:48:39","date_gmt":"2013-08-18T08:48:39","guid":{"rendered":"http:\/\/karstieltopia.com\/?p=301"},"modified":"2016-02-20T05:44:23","modified_gmt":"2016-02-20T05:44:23","slug":"distribuciones-de-linux-snapshot-14082013","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/distribuciones-de-linux-snapshot-14082013\/","title":{"rendered":"Distribuciones de Linux [snapshot 14\/08\/2013]"},"content":{"rendered":"<p>Desde hace muchos a\u00f1os he utilizado diferentes distribuciones de Linux, ya sea como sistema operativo principal, como secundario o en el servidor. De ah\u00ed he ido cambiando de opini\u00f3n de las diferentes distribuciones e inclusive he tenido tiempos en que Windows se volvi\u00f3 el sistema principal (b\u00e1sicamente por soporte de hardware) pero a la hora de trabajar, casi siempre he estado con Linux desde el 2000 aproximadamente (anteriormente utilic\u00e9 alg\u00fan Sparc, pero poco m\u00e1s).<\/p>\n<p>De ah\u00ed que en el t\u00edtulo ponga [snapshot 14\/08\/2013], porque intentar\u00e9 dar mi opini\u00f3n cada cierto tiempo de aquello que vaya probando y de lo que quiero probar.<\/p>\n<p>\u00a1Empecemos!<\/p>\n<h1>Ubuntu 13.04<\/h1>\n<p>Esta es la distribuci\u00f3n que ahora mismo tengo por defecto en el port\u00e1til. Es equilibrada en todos los aspectos, pero no la destaco en nada. Eso s\u00ed, justamente ah\u00ed est\u00e1 el motivo de que se haya quedado como escritorio base: funciona sin problemas en nada. Unity es usable, tenemos versiones actuales de los programas, los dos monitores funcionan bien al tiempo, la cpu est\u00e1 contenida y el gasto de bater\u00eda no est\u00e1 especialmente disparado.<\/p>\n<p>Eso s\u00ed, cosas que publicitan no las uso en absoluto. V\u00e9ase el buscador de todo (aplicaciones, documentos, etc), parece que pudiera ser \u00fatil pero sinceramente me resulta un incordio ver mis documentos o similares ah\u00ed.<\/p>\n<p>La integraci\u00f3n con redes sociales tampoco la utilizo porque es un tanto burda en mi opini\u00f3n y prefiero ir directamente a la web.<\/p>\n<p><strong><em>\u00bfRecomendable?<\/em> <\/strong>S\u00ed dado que puedes instalarlo y olvidarte pr\u00e1cticamente de \u00e9l y no da problemas importantes. No esperes la distro m\u00e1s optimizada, ni con las versiones m\u00e1s recientes, pero s\u00ed que tendr\u00e1s una distro estable, que funciona bien sin tocar nada y que al estar entre las m\u00e1s populares, casi todo lo que busques en cuanto a software, lo encontrar\u00e1s sin problemas.<\/p>\n<h1>Ubuntu Server 13.04<\/h1>\n<p>Durante mucho tiempo estuve con Ubuntu Server 12.04 en mi servidor (dedicado a dar servicio de samba para archivos e impresoras, servidor de descargas y servidor de versionado de c\u00f3digo), as\u00ed que cuando quise actualizar un poco la estructura de todo y empezar de cero, prob\u00e9 la nueva versi\u00f3n de la distro que llevaba usando para ello y la verdad es que la respuesta es un sin novedad en el frente.<\/p>\n<p>Igual que el resto de versiones, programas, librer\u00edas y kernels actualizados pero perdiendo el soporte.<\/p>\n<p><strong><em>\u00bfRecomendable?<\/em> <\/strong>Solamente si necesitas una versi\u00f3n de alguna librer\u00eda \/ kernel \/ programa, sino mejor la versi\u00f3n LTS 12.04, dado que tiene mayor soporte y en un servidor \u00e9sto es muy importante.<\/p>\n<h1>Xubuntu 13.04<\/h1>\n<p>Otra distro basada en Ubuntu que prob\u00e9 tambi\u00e9n, en este caso para el netbook que tengo. He de confesar que la primera opci\u00f3n fue Lubuntu pero no la llegu\u00e9 a instalar dado que no me reconoc\u00eda el touchpad y no pod\u00eda mover el cursor (ni idea de porqu\u00e9&#8230; pero no tengo especialmente tiempo libre, as\u00ed que no llegu\u00e9 a instalarla).<\/p>\n<p>B\u00e1sicamente he de decir que el XFCE que monta Xubuntu es muy amigable, va todo bien (hasta puedo moverme por la red interna con Thunar y todo est\u00e1 relativamente en su sitio y bien.<\/p>\n<p>No me gusta el hecho de que, igual que Ubuntu, utilice su centro de software directamente dado que es muy pesado aunque no pasa de anecd\u00f3tico porque siempre utilizo la terminal. As\u00ed que para ver que todo iba relativamente bien, empec\u00e9 a quitar servicios en el arranque con lo que aligerar el sistema.<\/p>\n<p><strong><em>\u00bfRecomendable?<\/em> <\/strong>S\u00ed y no. Funciona bien y podr\u00eda sustituir sin problemas a Ubuntu pero si lo quieres para un netbook o una m\u00e1quina de pocas prestaciones o solamente porque quieres tener recursos libres para dar y tomar, quiz\u00e1s ah\u00ed no sea la mejor opci\u00f3n porque, aun llevando XFCE, es bastante m\u00e1s pesado de lo que debiera.<\/p>\n<h1>Manjaro<\/h1>\n<p>Esta distribuci\u00f3n tambi\u00e9n la escog\u00ed para el netbook. Est\u00e1 basada en Arch pero con repositorios propios y muy cuidada, teniendo una sensaci\u00f3n constante de velocidad y de aprovechar la m\u00e1quina, calzando por defecto XFCE, aunque hay versiones para otros escritorios.<\/p>\n<p>Me gust\u00f3, sinceramente me gust\u00f3 mucho, pero me encontr\u00e9 con el problema de que despu\u00e9s de alguna actualizaci\u00f3n (generalmente drivers), \u00a0el se quedaba sistema un tanto inestable y hab\u00eda que repararlo &#8220;a mano&#8221;.<\/p>\n<p>Pero \u00e9sto tambi\u00e9n es el punto fuerte de toda distro basada en Arch: no habr\u00e1 que instalarla de nuevo de cero (salvo desastre) ya que es una rolling release y siempre los paquetes est\u00e1n entre los m\u00e1s nuevos posibles.<\/p>\n<p><em><strong>\u00bfRecomendable?<\/strong><\/em> Si tienes tiempo libre, s\u00ed, sino yo dir\u00eda que no. Aunque no es como un Arch puro que hay que cruzar dedos despu\u00e9s de cada actualizaci\u00f3n, aun lo sufre de vez en cuando, con lo que las posibilidades de que antes o despu\u00e9s tengas un sistema inestable que tengas que reparar a mano son altas&#8230; Eso s\u00ed, en su favor que tambi\u00e9n tiene una gran comunidad.<\/p>\n<h1>Crunchbang Waldorf<\/h1>\n<p>Esta distribuci\u00f3n tambi\u00e9n la prob\u00e9 en el netbook. La primera advertencia es que lleva OpenBox, as\u00ed que no esperes una gran vistosidad ni efectos por todas partes&#8230; no. Pero s\u00ed que puedes esperar un mont\u00f3n de ram libre y mucha velocidad.<\/p>\n<p>Est\u00e1 basada en Debian y de ah\u00ed parte de sus caracter\u00edsticas: es muy rocosa y funciona bien, pero no est\u00e1n las \u00faltimas versiones de los paquetes.<\/p>\n<p><em><strong>\u00bfRecomendable?<\/strong><\/em>\u00a0Si no te importa que lleve OpenBox y puedes hacerte con \u00e9l, la respuesta es que s\u00ed, sin duda.<\/p>\n<h1>openSUSE 12.3<\/h1>\n<p>Durante mucho, mucho tiempo, fui fan total de open Suse, sobre todo de su versi\u00f3n de KDE, aunque despu\u00e9s de unos a\u00f1os la cambi\u00e9 por otras versiones (\u00a1o hasta Windows!). En los \u00faltimos a\u00f1os tambi\u00e9n la utilic\u00e9 en el trabajo, con lo que volv\u00ed a familiarizarme con ella y no pod\u00eda evitar usarla en casa.<\/p>\n<p>La he usado en dos vertientes, en mi ordenador base (v\u00e9ase mi port\u00e1til), y ah\u00ed us\u00e9 KDE y en el servidor (ah\u00ed us\u00e9 XFCE&#8230; \u00a1no me pegu\u00e9is, luego lo explico).<\/p>\n<p>La versi\u00f3n KDE es preciosista hasta su m\u00e1xima expresi\u00f3n. Algo de lo que muchas veces pecan las distribuciones de Linux es que no son consistentes gr\u00e1ficamente y eso es algo que no le pasa a esta versi\u00f3n de KDE. El tema pega con todo y es agradable a la vista. A\u00f1adimos a eso el que todo funciona bien, con lo que tenemos una joya de distribuci\u00f3n&#8230;<\/p>\n<p>\u00bfY por qu\u00e9 no la tengo como distribuci\u00f3n base? Ah\u00ed el \u00fanico pero. Y es que al utilizarla en el port\u00e1til, \u00e9ste va equipado con dos gr\u00e1ficas (intel y nvidia) y yo quer\u00eda utilizar <a href=\"http:\/\/bumblebee-project.org\/\">Bumblebee <\/a>para manejar la nVidia, pero no me funcion\u00f3 correctamente y acab\u00e9 saltando a Ubuntu&#8230; Pero seguro, seguro que vuelvo en poco a probarla.<\/p>\n<p>Por su parte, instal\u00e9 en el servidor la versi\u00f3n de XFCE de esta distro por dos razones:<\/p>\n<ol>\n<li><span style=\"line-height: 13px;\">Yast. Mucha gente lo odia, y con raz\u00f3n, pero cuando te haces a \u00e9l, te acaba facilitando mucho la vida y adem\u00e1s tiene una versi\u00f3n en texto, con lo que puedes atacar directamente por ssh al servidor y aun as\u00ed tirar de Yast. Como ejemplo, decir que pude configurar todo lo referente al firewall, ruteos y dem\u00e1s (porque ahora el servidor tambi\u00e9n es el punto de acceso a internet de la casa) sin ning\u00fan problema usando solamente Yast. \u00bfPodr\u00eda haberlo hecho a mano? Claro, pero tambi\u00e9n as\u00ed.<\/span><\/li>\n<li>Interfaz gr\u00e1fica. Puse XFCE porque aunque es un servidor (no arranca las X por defecto), me encontr\u00e9 en el pasado en que en mi casa podr\u00eda no estar ning\u00fan ordenador encendido y querer acceder al servidor. O inclusive algo que no funcionaba bien o un mont\u00f3n de cosas. As\u00ed que quer\u00eda tener la opci\u00f3n de tener el servidor con un entorno gr\u00e1fico instalado por si fuera necesario y claro, ya puestos, \u00bfqu\u00e9 mejor que una distro que venga con \u00e9l bien configurado por defecto? As\u00ed que ah\u00ed se qued\u00f3 en mi equipo :)<\/li>\n<\/ol>\n<p><strong><em><em><strong>\u00bfRecomendable?\u00a0<\/strong><\/em>\u00a0<\/em><\/strong>Sin dudarlo. Si no tienes ning\u00fan problema con compatibilidad de equipo o quiz\u00e1s alguna versi\u00f3n de paqueter\u00eda que no encuentres (recordar que es RPM, no DEB), creo que es una opci\u00f3n trem\u00e9ndamente v\u00e1lida y poco utilizada en general<\/p>\n<p>&nbsp;<\/p>\n<p>As\u00ed que ah\u00ed se ha quedado mi revisi\u00f3n a d\u00eda de hoy. En resumen dir\u00e9 que tengo Ubuntu 13.04 en el port\u00e1til (que es mi ordenador base), \u00a0Crunchbang Waldorf en el netbook y open Suse 12.3 en el servidor, siendo esa mi elecci\u00f3n totalmente subjetiva y condicionada al hardware de mis equipos.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Desde hace muchos a\u00f1os he utilizado diferentes distribuciones de Linux, ya sea como sistema operativo principal, como secundario o en el servidor. De ah\u00ed he ido cambiando de opini\u00f3n de las diferentes distribuciones e inclusive he tenido tiempos en que Windows se volvi\u00f3 el sistema principal (b\u00e1sicamente por soporte de hardware) pero a la hora [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[64],"tags":[70,65,69,68,66,67],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Distribuciones de Linux [snapshot 14\/08\/2013] - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/distribuciones-de-linux-snapshot-14082013\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Distribuciones de Linux [snapshot 14\/08\/2013] - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Desde hace muchos a\u00f1os he utilizado diferentes distribuciones de Linux, ya sea como sistema operativo principal, como secundario o en el servidor. De ah\u00ed he ido cambiando de opini\u00f3n de las diferentes distribuciones e inclusive he tenido tiempos en que Windows se volvi\u00f3 el sistema principal (b\u00e1sicamente por soporte de hardware) pero a la hora [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/distribuciones-de-linux-snapshot-14082013\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2013-08-18T08:48:39+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-20T05:44:23+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/distribuciones-de-linux-snapshot-14082013\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/distribuciones-de-linux-snapshot-14082013\/\",\"name\":\"Distribuciones de Linux [snapshot 14\/08\/2013] - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2013-08-18T08:48:39+00:00\",\"dateModified\":\"2016-02-20T05:44:23+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/sistemas-operativos\/linux\/distribuciones-de-linux-snapshot-14082013\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-4R","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/301"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=301"}],"version-history":[{"count":9,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/301\/revisions"}],"predecessor-version":[{"id":327,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/301\/revisions\/327"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=301"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}