{"id":562,"date":"2010-01-26T00:18:00","date_gmt":"2010-01-26T00:18:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2010\/01\/26\/sobre-el-cine-en-multples-dimensiones\/"},"modified":"2016-02-19T16:40:27","modified_gmt":"2016-02-19T16:40:27","slug":"sobre-el-cine-en-multples-dimensiones","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/peliculas\/sobre-el-cine-en-multples-dimensiones\/","title":{"rendered":"Sobre el cine en m\u00faltples dimensiones"},"content":{"rendered":"<p>La verdad es que nunca antes hab\u00eda visto una pel\u00edcula en 3D y claro, teniendo todav\u00eda la pel\u00edcula de Avatar en el cine (qu\u00e9 por cierto, lo que cuesta llegar a verla en 3D&#8230; \u00a1siguen las salas llenas a estas alturas!) y que casualmente hay uno relativamente al lado del trabajo y con una sesi\u00f3n que encima empezaba a las 19h y, leches, hab\u00eda posibilidad de cogerlo en el d\u00eda del espectador&#8230; \u00bfc\u00f3mo no iba a aprovechar la oportunidad de ver la que dicen mejor pel\u00edcula en 3D que ha sido parida por el momento? Adem\u00e1s as\u00ed ten\u00eda la oportunidad de compararla con la versi\u00f3n 2D que hab\u00eda visto previamente (y qu\u00e9 hab\u00eda comentado <a href=\"http:\/\/pongaunagujeronegroensuvida.blogspot.com\/2010\/01\/avatar.html\">aqu\u00ed<\/a>).<\/p>\n<p>Pues bien, despu\u00e9s del pago de 9\u20ac (y dando gracias de que era el d\u00eda del espectador), me dieron en calidad de pr\u00e9stamo unas curiosas gafas (parec\u00edan de esquiador :S) y una toallita h\u00fameda para limpiarlas (me han comentado luego que suelen usar un mecanismo diario para limpiarlas&#8230; pero bueno, ya pod\u00eda venir limpias despu\u00e9s de cada sesi\u00f3n, qu\u00e9 para lo que cobran&#8230;)<\/p>\n<p>En fin, que estaba dentro ya del cine y con las gafas relativamente limpias, hice una prueba de pon\u00e9rmelas antes de empezar la pel\u00edcula para ver que tal&#8230; Pufff, se colocaron bien encima de mis gafas (con semejante tama\u00f1o es normal), pero ya not\u00e9 que enseguida me doler\u00eda la nariz.. \u00a1menudo peso que ten\u00edan las condenadas!<\/p>\n<p>Despu\u00e9s de las dudas iniciales de si me hab\u00edan dado unas gafas polarizadas o unas gafas de sol, empez\u00f3 ya la pel\u00edcula y las gafas puestas :D<\/p>\n<p>Lo primero que puedo decir es que la sensaci\u00f3n es curiosa dado que parec\u00eda que exist\u00edan unos ciertos planos, con lo que la sensaci\u00f3n de profundidad aumentaba y tampoco tard\u00e9 mucho en acostumbrarme a ello.<\/p>\n<p>Bien, ya estaba viendo el famoso 3D y bien, los pasillos y &#8220;tubos&#8221; era d\u00f3nde m\u00e1s lo notaba al principio, aunque posteriormente se notaba sobre todo por las diferentes cosas que iban flotando en un plano diferente al de la acci\u00f3n, etc. Aunque sin duda, lo m\u00e1s curioso eran los subt\u00edtulos, \u00a1c\u00f3mo flotaban los condenados! :D<\/p>\n<p>Curiosamente cada vez que miraba por el rabillo del ojo, al volver a la pel\u00edcula notaba que las cosas no estaban como deb\u00edan y hasta pasado unos segundos no volv\u00eda a apreciar correctamente el volumen.<\/p>\n<p>Por ahora todo iba bien, salvo por un detalle muy molesto. Parece que, aunque ahora de repente tienes profundidad, resulta que casi s\u00f3lo puedes mirar all\u00ed d\u00f3nde el director ha querido que mires. Me explico, resulta que normalmente el objeto principal en cualquier composici\u00f3n suele estar n\u00edtido en contraste con lo poco importante que pasa a estar en un &#8220;segundo plano&#8221;, el cu\u00e1l puede estar inclusive difuminado (sensaci\u00f3n de que la c\u00e1mara enfoca solamente al objeto principal). Pues bien, cuando estamos en 3D, resulta que ese &#8220;segundo plano&#8221; es brutal y cuesta much\u00edsimo verlo porque est\u00e1 totalmente desenfocado.<\/p>\n<p>Otra cosa que tampoco me gust\u00f3 es que hab\u00eda veces en que me costaba ver los contornos exactos de algunas cosas. Por supuesto que otra cosa que tampoco me acab\u00f3 de convencer fue que ver una pel\u00edcula con una especie de gafas de sol, hace que pierdas mucho color de la pel\u00edcula.<\/p>\n<p>Ahhhh, y lo que creo que fue lo peor con diferencia&#8230; \u00a1las malditas gafas! Menudo dolor nasal que ten\u00eda al terminar la pel\u00edcula, sinceramente estuve por lanz\u00e1rsela a la cabeza a los recogedores de gafas para ahorrar el dolor de los siguientes que entraran.<\/p>\n<p>En resumen, y siempre en mi opini\u00f3n, este tipo de cine sigue en pa\u00f1ales y creo que todav\u00eda no deber\u00eda usarse tan masivamente como parece que la industria del cine quiere usarlo. Las gafas son muy molestas y quedan bastantes detalles por pulir para tener una experiencia realmente cautivadora.<\/p>\n<p><b>Pd.1.<\/b> El lado del precio ya lo doy por supuesto. \u00bfC\u00f3mo demonios cobran tanto por ello?<\/p>\n<p><b>Pd.2.<\/b> Por cierto, si quer\u00e9is un art\u00edculo completo sobre \u00e9sto, mirar <a href=\"http:\/\/ocularis.es\/blog\/?p=363\">\u00e9sto<\/a> ;)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>La verdad es que nunca antes hab\u00eda visto una pel\u00edcula en 3D y claro, teniendo todav\u00eda la pel\u00edcula de Avatar en el cine (qu\u00e9 por cierto, lo que cuesta llegar a verla en 3D&#8230; \u00a1siguen las salas llenas a estas alturas!) y que casualmente hay uno relativamente al lado del trabajo y con una sesi\u00f3n [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[870],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Sobre el cine en m\u00faltples dimensiones - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/ocio\/peliculas\/sobre-el-cine-en-multples-dimensiones\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Sobre el cine en m\u00faltples dimensiones - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"La verdad es que nunca antes hab\u00eda visto una pel\u00edcula en 3D y claro, teniendo todav\u00eda la pel\u00edcula de Avatar en el cine (qu\u00e9 por cierto, lo que cuesta llegar a verla en 3D&#8230; \u00a1siguen las salas llenas a estas alturas!) y que casualmente hay uno relativamente al lado del trabajo y con una sesi\u00f3n [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/ocio\/peliculas\/sobre-el-cine-en-multples-dimensiones\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2010-01-26T00:18:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-19T16:40:27+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/peliculas\/sobre-el-cine-en-multples-dimensiones\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/ocio\/peliculas\/sobre-el-cine-en-multples-dimensiones\/\",\"name\":\"Sobre el cine en m\\u00faltples dimensiones - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2010-01-26T00:18:00+00:00\",\"dateModified\":\"2016-02-19T16:40:27+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/ocio\/peliculas\/sobre-el-cine-en-multples-dimensiones\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-94","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/562"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=562"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/562\/revisions"}],"predecessor-version":[{"id":1956,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/562\/revisions\/1956"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=562"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=562"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=562"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}