{"id":1269,"date":"2007-01-04T13:43:00","date_gmt":"2007-01-04T13:43:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2007\/01\/04\/destripando-a-la-psp\/"},"modified":"2016-02-19T11:45:06","modified_gmt":"2016-02-19T11:45:06","slug":"destripando-a-la-psp","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/","title":{"rendered":"Destripando a la PSP"},"content":{"rendered":"<p>Vamos a hablar sobre la dichosa m\u00e1quina portatil de Sony, llamada <a href=\"http:\/\/www.yourpsp.com\/\">PSP<\/a> (Playstation Portable)<\/p>\n<div><img loading=\"lazy\" width=\"500\" height=\"262\" title=\"psp_fb.jpg\" alt=\"psp_fb.jpg\" src=\"https:\/\/i2.wp.com\/i967.photobucket.com\/albums\/ae156\/pongaunagujeronegroensuvida\/blog_juegos\/psp_fb.jpg?resize=500%2C262\" data-recalc-dims=\"1\"><\/div>\n<p><\/p>\n<div><\/p>\n<ol><\/p>\n<li><strong>\u00bfQu\u00e9 es?<\/strong> Bien, empecemos por decir que es: La PSP es ni m\u00e1s ni menos que es la consola portatil de Sony, en la que podremos ejecutar los juegos para dicho aparato, adem\u00e1s de ver pel\u00edculas, fotos y escuchar m\u00fasica. Tambi\u00e9n se podr\u00e1 navegar por Internet (algo limitadamente debido a su navegador) y sindicarse por RSS. C\u00f3mo colof\u00f3n, tambi\u00e9n emula, en su \u00faltima versi\u00f3n, a la Playstation 1. Tambi\u00e9n, se a\u00f1ade soporte a cosas que en Jap\u00f3n ya existen para ella, como una c\u00e1mara de v\u00eddeo o un sistema GPS.<\/li>\n<p><\/p>\n<li><strong>Especificaciones t\u00e9cnicas: <\/strong>esta m\u00e1quina consta de una CPU con dos n\u00facleos MIPS R4000 que trabaja a una velocidad de 333Mhz (aunque generalmente trabaje a 222Mhz para conservar bater\u00eda). Memoria principal de 8MB y DRAM de 4MB. La pantalla tiene una resoluci\u00f3n de 480&#215;272 pixels, siendo en formato panor\u00e1mico de 4:3 o 16:9. En cuanto al sonido, dispone de un motor DSP reconfigurable y del Sony VME, con los codecs para sonido 3D, ATRAC3 plus, AAC, MP3, WMA, AVC y H.264. En cuanto a controles, los t\u00edpicos botones direccionales, m\u00e1s 6 de acci\u00f3n, m\u00e1s un control anal\u00f3gico y botones para volumen, accesos directos a im\u00e1genes y v\u00eddeo y los botones de select y start. Como almacenamiento, se utilizan por una lado las Memory Sticks como tarjetas de memoria y, para el contenido &#8220;comprado&#8221;, discos UMD (Universal Media Disc) que tienen una capacidad de 1.8 GB.<\/li>\n<p><\/p>\n<li><strong>Ventajas:<\/strong> tener una playstation entre la 1 y la 2 portatil&#8230; Pero no, esa no es la principal ventaja de este engendro. La principal, y que la mantiene totalmente viva, es el homebrew (aplicaciones hechas por terceros).<br \/>Cronol\u00f3gicamente, el problema mayoritario de estas aplicaciones es que solo funcionaban con la versi\u00f3n 1.5 del firmware de la PSP (Sony ha ido actualizando su sistema para, por un lado tener nuevas prestaciones y, por otro lado, ir eliminando el homebrew), con lo que se ha tenido que ir lidiando con cada versi\u00f3n del firmware de Sony para intentar volver a esa versi\u00f3n 1.5.<br \/>Pero, \u00bfpor qu\u00e9 esos deseos de usar homebrew? Pues&#8230; entre las aplicaciones m\u00e1s famosas nos encontramos cosas como los emuladores de otras consolas a emuladores de firmwares m\u00e1s modernos de la propia PSP y, sobre todo, la posibilidad de ejecutar ISOs (im\u00e1genes de juegos) directamente grabados en la Memory Stick, sin tener que tener el UMD del juego en la consola.<br \/>Y uno de los avances que la est\u00e1n revolucionando \u00faltimamente, es el \u00faltimo firmware creado por Dark_AleX (casi un dios en esta m\u00e1quina), el 3.02 OE, el cu\u00e1l ofrece todas las caracter\u00edsticas de la 3.02 y la posibilidad de ejecuci\u00f3n de todo el homebrew realizado para la 1.5 sin problemas&#8230; Pero, como he dicho, da todas las caracter\u00edsticas de la 3.02, entre las que se encuentra el emulador de la PSX, con lo que ahora mismo, con dicho firmware, tenemos todos los juegos de la PSX funcionando en la PSP, lo cual es un cat\u00e1logo impresionante.<br \/>Los \u00fanicos inconvenientes de este firmware (por ahora), es que no acaban de funcionar bien los juegos de PSX en formato PAL (pero hay convertidores a NTSC), y que las ISOs de PSX no est\u00e1n todav\u00eda comprimidos, con lo que ocupan bastante en la memory stick.<\/li>\n<p><\/p>\n<li><strong>Desventajas: <\/strong>entre las numerosas cosas que se dicen de ella, quiz\u00e1s la duraci\u00f3n de la bater\u00eda y el nefasto pad de control son las peores de todas.  Tambi\u00e9n hay gente que argumenta sobre el tama\u00f1o de la consola, pero entiendo que \u00e9sto es tambi\u00e9n un poco subjetivo. Otro problema, a mi entender, es el haber inclu\u00eddo el sistema de UMD, dado que incluye sistemas mec\u00e1nicos en la consola, con la degradaci\u00f3n de la bater\u00eda por este motivo.<br \/>Tambi\u00e9n, pero \u00e9sto es ya m\u00e1s a nivel de Sony y acompa\u00f1antes, hablar que el cat\u00e1logo de juegos es un poco reducido en cuanto a variedad (sobre todo en Europa), y qu\u00e9 Sony siempre maltrata a Europa con retrasos (el lanzamiento de la PSP en Jap\u00f3n fue el 12 de Noviembre del 2004, mientras que a Europa lleg\u00f3 el 1 de Septiembre del 2005) y la igualaci\u00f3n de dolar con euro, aunque esto es ya una extra\u00f1a costumbre, como podemos ver en Apple.<br \/>Otra curiosidad, que es sobre el emulador de la PSX, es que se ha dise\u00f1ado para que los juegos se descarguen de la p\u00e1gina oficial de Playstation, a trav\u00e9s de una PS3 y se transfieran posteriormente a la PSP (s\u00ed, habr\u00eda que tener todo \u00e9sto para jugar a alg\u00fan juego de la PSX, adem\u00e1s de pagar por \u00e9l de nuevo, si es que lo tuvi\u00e9semos original) pero, como he dicho en el punto anterior, Dark_AleX ha dicho algo al respecto ;)<\/li>\n<p><\/p>\n<li><strong>Futuro: <\/strong>adem\u00e1s de nuevas versiones de Firmware con m\u00e1s funciones, las ya mencionadas de GPS y c\u00e1mara de v\u00eddeo.<\/li>\n<p><\/ol>\n<p>En fin, en mi opini\u00f3n una gran m\u00e1quina :)<\/p>\n<p><strong>Actualizaci\u00f3n:<\/strong> hab\u00eda comentado en el punto 3 que hab\u00eda un problemilla con las ISOs de la PSX que no estaban comprimidas&#8230; pues bien, ayer mismo he le\u00eddo que acaba de publicarse la versi\u00f3n 3.03A OE y ahora ya pueden estar comprimidas ^^<br \/><strong>M\u00e1s informaci\u00f3n:<\/strong><br \/><a href=\"http:\/\/es.wikipedia.org\/wiki\/PlayStation_Portable\">http:\/\/es.wikipedia.org\/wiki\/PlayStation_Portable<\/a><br \/>http:\/\/blog.alucardx.net\/?p=635<br \/><a href=\"http:\/\/beta.pesepe.com\/\">http:\/\/beta.pesepe.com\/<\/a><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Vamos a hablar sobre la dichosa m\u00e1quina portatil de Sony, llamada PSP (Playstation Portable) \u00bfQu\u00e9 es? Bien, empecemos por decir que es: La PSP es ni m\u00e1s ni menos que es la consola portatil de Sony, en la que podremos ejecutar los juegos para dicho aparato, adem\u00e1s de ver pel\u00edculas, fotos y escuchar m\u00fasica. Tambi\u00e9n [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[872],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Destripando a la PSP - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Destripando a la PSP - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Vamos a hablar sobre la dichosa m\u00e1quina portatil de Sony, llamada PSP (Playstation Portable) \u00bfQu\u00e9 es? Bien, empecemos por decir que es: La PSP es ni m\u00e1s ni menos que es la consola portatil de Sony, en la que podremos ejecutar los juegos para dicho aparato, adem\u00e1s de ver pel\u00edculas, fotos y escuchar m\u00fasica. Tambi\u00e9n [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2007-01-04T13:43:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-19T11:45:06+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/i967.photobucket.com\/albums\/ae156\/pongaunagujeronegroensuvida\/blog_juegos\/psp_fb.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"ImageObject\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/#primaryimage\",\"inLanguage\":\"es\",\"url\":\"http:\/\/i967.photobucket.com\/albums\/ae156\/pongaunagujeronegroensuvida\/blog_juegos\/psp_fb.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/\",\"name\":\"Destripando a la PSP - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/#primaryimage\"},\"datePublished\":\"2007-01-04T13:43:00+00:00\",\"dateModified\":\"2016-02-19T11:45:06+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/ocio\/juegos\/destripando-a-la-psp\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-kt","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1269"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=1269"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1269\/revisions"}],"predecessor-version":[{"id":1893,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/1269\/revisions\/1893"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=1269"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=1269"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=1269"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}