{"id":589,"date":"2009-10-25T23:50:00","date_gmt":"2009-10-25T23:50:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2009\/10\/25\/sobreviviendo-a-la-vuelta-de-vacaciones\/"},"modified":"2016-02-20T15:58:05","modified_gmt":"2016-02-20T15:58:05","slug":"sobreviviendo-a-la-vuelta-de-vacaciones","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/programacion\/trabajo\/sobreviviendo-a-la-vuelta-de-vacaciones\/","title":{"rendered":"Sobreviviendo a la vuelta de vacaciones"},"content":{"rendered":"<p>Y es que como habr\u00e9is visto, estuve hace un par de semanas de vacaciones y, volv\u00ed con esta entrada en el blog&#8230; \u00a1pero volv\u00ed a desaparecer durante una semana! \u00bfCu\u00e1l ser\u00eda la extra\u00f1a raz\u00f3n por la que hubo una desaparici\u00f3n total? (m\u00fasica de fondo de suspense&#8230; \u00a1tan taan taaaaaaan!)<\/p>\n<p>Pues resulta que tuve una no muy grata sorpresa a la vuelta. Resulta que en el proyecto en el que soy un cheerleader t\u00e9cnico le adelantaron la entrega de proyecto unas cuantas semanas porque el cliente no le gustaba la fecha de entrega que se le hab\u00eda dado casi un mes antes.<\/p>\n<p>As\u00ed que me encontr\u00e9 con una fase del proyecto que tendr\u00eda que ser terminada en una semana y de la que llev\u00e1bamos aproximadamente la mitad (y para esa mitad hab\u00edamos necesitado cosa de 2 semanas y media tirando a tres).<\/p>\n<p>La primera fase fue, por supuesto, la de jurar en hebreo (y cualquier otra lengua conocida o sin conocer) y poner al equipo a trabajar. El proyecto consiste en cambiar un producto enorme (por poner un n\u00famero, cerca de unas 400.000 l\u00edneas de c\u00f3digo) de una m\u00e1quina a otra con una arquitectura y un sistema operativo diferente, adem\u00e1s de unos cambios en unas librer\u00edas y de cambio de compilador (de cc a gcc). \u00c9sto provoca problemas totalmente inveros\u00edmiles, como cambios en el alineamiento de los datos en la memoria, problemas extra\u00f1\u00edsimos de cosas que no funcionan (por ejemplo, un strcpy tiene un mont\u00f3n de posibilidades de reventar en la nueva m\u00e1quina y hay que usar el sprintf), manejo de sockets totalmente diferentes, cambios en mmap, etc. Vamos, el resumen es que te puedes encontrar con absolutamente cualquier cosa (adem\u00e1s de que un c\u00f3digo tan ingentemente grande ha sido parido por un mont\u00f3n de personas, as\u00ed que&#8230;).<\/p>\n<p>En fin, ese mismo lunes estuve chateando masivamente con el se\u00f1or jefecillo alem\u00e1n del que surgi\u00f3 todo \u00e9sto, e hizo la grandiosa pregunta de &#8220;\u00bfQu\u00e9 quieres para que lleguemos el viernes?&#8221; Estando tentado a contestarle lo que me sugirieron mis compa\u00f1eros (\u00a16000\u20ac! xD), la respuesta fue m\u00e1s gente o hacer horas extra&#8230; As\u00ed que accedi\u00f3 a lo \u00faltimo y que devolver\u00edan el tiempo como horas libres.<\/p>\n<p>As\u00ed trancurri\u00f3 la semana, con cuatro reportes al d\u00eda, con errores rar\u00edsimos, con nervios en Alemania (intentando lanzarnos cualquier cosa que fallase a nosotros) y al rev\u00e9s igualmente. Recibiendo &#8220;ayudas&#8221; extra\u00f1as de gurus alem\u00e1nes que al final solo repercutieron en dos o tres problemas que encontramos (al final hubo unos 70-80 problemas reportados en la rama de desarrollo xD), &#8220;reportando&#8221; sin parar, con otras frases m\u00edticas como el mismo viernes que te digan &#8220;La bola est\u00e1 en vuestro lado&#8221; despu\u00e9s de que t\u00e9cnicamente se hayan negado en Alemania a hacer su trabajo, etc.<\/p>\n<p>Pero el viernes a la tarde, todos los tests unitarios autom\u00e1ticos funcionaban; la rama estaba bonita y reluciente y se lanzaron todas las pruebas durante el fin de semana (a fin de cuentas, \u00bfcu\u00e1ntas veces hemos arreglado algo y destrozado otra cosa?).<\/p>\n<p>Despu\u00e9s de todo \u00e9sto, tocar\u00e1 empezar ma\u00f1ana a recordar activamente que tengo unas vacaciones que tienen que ser dadas (y es que Alemania est\u00e1 lejos y se olvidan de las cosas); que para algo he hecho 18.5 horas extra esta semana y eso corresponden a 32 horas y pico seg\u00fan el convenio, lo cual involucra cuatro d\u00edas m\u00e1s de vacaciones&#8230; A ver cuando las veo.<\/p>\n<p>As\u00ed fueron las cosas y as\u00ed se las hemos contado xD<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Y es que como habr\u00e9is visto, estuve hace un par de semanas de vacaciones y, volv\u00ed con esta entrada en el blog&#8230; \u00a1pero volv\u00ed a desaparecer durante una semana! \u00bfCu\u00e1l ser\u00eda la extra\u00f1a raz\u00f3n por la que hubo una desaparici\u00f3n total? (m\u00fasica de fondo de suspense&#8230; \u00a1tan taan taaaaaaan!) Pues resulta que tuve una no [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[922],"tags":[918,919],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Sobreviviendo a la vuelta de vacaciones - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/programacion\/trabajo\/sobreviviendo-a-la-vuelta-de-vacaciones\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Sobreviviendo a la vuelta de vacaciones - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Y es que como habr\u00e9is visto, estuve hace un par de semanas de vacaciones y, volv\u00ed con esta entrada en el blog&#8230; \u00a1pero volv\u00ed a desaparecer durante una semana! \u00bfCu\u00e1l ser\u00eda la extra\u00f1a raz\u00f3n por la que hubo una desaparici\u00f3n total? (m\u00fasica de fondo de suspense&#8230; \u00a1tan taan taaaaaaan!) Pues resulta que tuve una no [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/programacion\/trabajo\/sobreviviendo-a-la-vuelta-de-vacaciones\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2009-10-25T23:50:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-20T15:58:05+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/programacion\/trabajo\/sobreviviendo-a-la-vuelta-de-vacaciones\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/programacion\/trabajo\/sobreviviendo-a-la-vuelta-de-vacaciones\/\",\"name\":\"Sobreviviendo a la vuelta de vacaciones - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2009-10-25T23:50:00+00:00\",\"dateModified\":\"2016-02-20T15:58:05+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/programacion\/trabajo\/sobreviviendo-a-la-vuelta-de-vacaciones\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-9v","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/589"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=589"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/589\/revisions"}],"predecessor-version":[{"id":2211,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/589\/revisions\/2211"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=589"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=589"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=589"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}