{"id":729,"date":"2008-11-25T03:24:00","date_gmt":"2008-11-25T03:24:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2008\/11\/25\/atracon-de-peliculas\/"},"modified":"2016-02-19T16:40:29","modified_gmt":"2016-02-19T16:40:29","slug":"atracon-de-peliculas","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/peliculas\/atracon-de-peliculas\/","title":{"rendered":"Atrac\u00f3n de pel\u00edculas"},"content":{"rendered":"<p>Y es que aunque no haya puesto nada de las \u00faltimas pel\u00edculas que he ido viendo, lo cierto es que he tenido un atrac\u00f3n de pel\u00edculas la mar de considerable&#8230; as\u00ed que aqu\u00ed va un peque\u00f1o resumen de todas :D<\/p>\n<table border=\"0\"><\/p>\n<tbody><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Red de mentiras<\/em><\/strong><\/td>\n<p><\/p>\n<td>Ten\u00eda para escoger: o ver \u00e9sta o ver la \u00faltima del 007 y, las cosas como son, acabe escogiendo esta porque exist\u00edan m\u00e1s posibilidades de que me llamara la atenci\u00f3n y, sinceramente, no ha estado nada mal.<\/p>\n<p>La situaci\u00f3n es m\u00e1s o menos la siguiente: mundo isl\u00e1mico y conspiraciones terroristas para atacar al resto del mundo. Un argumento no original, pero que ha sido llevado bastante bien, record\u00e1ndome muchas veces a la pel\u00edcula del Se\u00f1or de la Guerra, as\u00ed que sin dudarlo s\u00ed que recomiendo esta pel\u00edcula, sabiendo que por momentos es bastante cruda (aunque apenas hay nada expl\u00edcito).<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Babylon AD<\/em><\/strong><\/td>\n<p><\/p>\n<td>Antes o despu\u00e9s iba a verla (si es que con que algo ponga futurista, las tentaciones se vuelven insufribles), pero si ya el propio director clamaba al cielo porque le hab\u00edan cortado el rodaje casi al 50% y hab\u00edan puesto escenas que no quer\u00eda pues&#8230; eso&#8230;<\/p>\n<p>En fin, viendo la pel\u00edcula nos encontramos con un Vin Diesel en su papel de t\u00edo super guay (al m\u00e1s puro estilo de las Cr\u00f3nicas de Riddick), pero que se va desmantelando por momentos cuando se va viendo que va saltando de escena en escena sin saber muy bien c\u00f3mo ha llegado a cada momento.<\/p>\n<p>Parece un intento de imitar la pel\u00edcula Hijos de los Hombres, pero se queda en la intentona y con avisos de que podr\u00eda haber sido mucho mejor pel\u00edcula.<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Star Wars: The clone wars<\/em><\/strong><\/td>\n<p><\/p>\n<td>Star Wars en im\u00e1genes renderizadas&#8230; Eso lo dice casi todo. Dec\u00edan por ah\u00ed que \u00e9sto explicaba el vac\u00edo argumental entre la segunda y tercera pel\u00edcula (de las nuevas), pero lo cierto es que lo que nos muestra no es m\u00e1s que lo que podr\u00eda ser el episodio piloto de una serie orientada claramente al p\u00fablico m\u00e1s joven (o lo que ellos piensan que deber\u00eda ser ese p\u00fablico, porque sin sangre&#8230; \u00bfcreen que los jovencitos ver\u00e1n estas cosas?). Resultado, una pel\u00edcula para pasar el rato.<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><em><strong>Kung-fu panda<\/strong><\/em><\/td>\n<p><\/p>\n<td>Un oso panda viciado a las pel\u00edculas de kung-fu se vuelve el m\u00e1s poderoso de todos los entes de la regi\u00f3n. Unas cu\u00e1ntas escenas son muy buenas (te r\u00edes mucho), pero es muy previsible y bastante facilona :\/<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Wanted<\/em><\/strong><\/td>\n<p><\/p>\n<td>Estra\u00f1a pel\u00edcula que dec\u00edan que se basaba en un c\u00f3mic que no he le\u00eddo. Por ah\u00ed tambi\u00e9n he le\u00eddo que si no conoces el comic, la pel\u00edcula no est\u00e1 mal del todo, pero que si s\u00ed que lo conoces, clamar\u00e1s al cielo por lo que han hecho.<\/p>\n<p>Despu\u00e9s de verla pues s\u00ed, no est\u00e1 tan mal, pero pufffff&#8230; una historia mejor, pardiez, que por mucho que intentaron hacerla &#8220;imprevisible&#8221;, el tener a la Jolie solamente para poner sus miradas pues tambi\u00e9n es un indicador del tipo de pel\u00edcula xD<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Bangkok dangerous<\/em><\/strong><\/td>\n<p><\/p>\n<td>Al pobre Nicolas Cage le est\u00e1n martirizando \u00faltimamente sus pel\u00edculas. Siempre me ha parecido que es un actor que tiende a sobreactuar cosa mala, pero que ten\u00eda unos papeles bastante buenos, pero es que menuda trayectoria lleva con cosas como el Motorista Fantasma :S<\/p>\n<p>En fin, volviendo a la pel\u00edcula, este se\u00f1or encarna a un asesino\/mercenario que mata a todo aquel que le se\u00f1alan por dinero, teniendo una vida en la que no tiene contacto con nadie; pero claro, llega la t\u00edpica srta, el t\u00edpico chico guay que tiene que ser su amigo y ya toda una vida al traste&#8230;<\/p>\n<p>Muy previsible, poca acci\u00f3n, todo muuuuuuy normalito. Para pasar el rato.<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><em><strong>Al final de la escalera<\/strong><\/em><\/td>\n<p><\/p>\n<td>Una de las consideradas grandes pel\u00edculas de terror de todos los tiempos&#8230; Nunca la hab\u00eda visto, as\u00ed que fue un buen momento para verla.<\/p>\n<p>Nos situamos ante un compositor que ha perdido a su familia y decide vivir en una macro mansi\u00f3n abandonada que ha alquilado. En un principio todo va bien, pero empiezan a aparecer ruidos y, de repente un buen d\u00eda, encuentra una puerta que lleva al desv\u00e1n&#8230;<\/p>\n<p>Una buena pel\u00edcula pero que, en mi opini\u00f3n, adolece con los a\u00f1os&#8230; Me parece que los nuevos tiempos ya no se asustan con tanta facilidad :\/<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Reflejos<\/em><\/strong><\/td>\n<p><\/p>\n<td>Otra pel\u00edcula de terror, pero esta mucho m\u00e1s actual. Nos encontramos con que hay otro mundo al otro lado del espejo, y ese otro mundo es mucho m\u00e1s mal\u00e9fico que el de este lado&#8230;<\/p>\n<p>Resumen global&#8230; para pasar el rato y de sustos f\u00e1ciles&#8230; aunque luego te cuesta m\u00e1s ir delante de un espejo :D<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Wall-e<\/em><\/strong><\/td>\n<p><\/p>\n<td>Creo que todos ya sab\u00e9is de que va esta pel\u00edcula y, una gran mayor\u00eda de vosotros tambi\u00e9n la habr\u00e1 visto, as\u00ed que directamente mi opini\u00f3n&#8230;<\/p>\n<p>Sigo sin entender porque dicen que la pel\u00edcula es tan moralista, porque lo \u00fanico que hacen es poner un par de ideas sencillotas y desde ah\u00ed continuar toda la historia y, sobre todo, me parece que toda la parte final de la pel\u00edcula es excesivamente artificial, una final muy orientado para quedarnos felices :\/<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>El reino prohibido<\/em><\/strong><\/td>\n<p><\/p>\n<td>Otra pel\u00edcula en la que sale una frase tipo &#8220;Mu\u00e9strame tu kung-fu&#8221; xD<\/p>\n<p>M\u00e1s o menos trata sobre una personita que es una viciada de las artes marciales y en un accidente accede a otro mundo d\u00f3nde se encuentra metido de lleno entre la lucha de unos inmortales.<\/p>\n<p>\u00bfQu\u00e9 tenemos como resultado? Pues una pel\u00edcula con un par de escenas de acci\u00f3n curiosas y nada m\u00e1s, pero si no ten\u00e9is otra cosa que ver&#8230;<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Max Payne<\/em><\/strong><\/td>\n<p><\/p>\n<td>Ainsss, si no hubiera jugado al juego (el cu\u00e1l confieso que nunca me pas\u00e9 :S), quiz\u00e1s no la hubiera mirado con ojos tan cr\u00edticos.<\/p>\n<p>Una droga pulula por ah\u00ed que hace que todo el mundo crea que est\u00e1n en mitad de una guerra mitol\u00f3gica e intentan acceder al Vallhala. Pero por ah\u00ed pasaba Max con su familia asesinada y puso todo patas arriba.<\/p>\n<p>Algunas escenas buenas (la recortada est\u00e1 muy bien) y unos efectos especiales muy curiosos (que si no me equivoco, no hab\u00eda nada de eso en el juego). Se qued\u00f3 en un quiero ser y no puedo.<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><em><strong>Speed Racer<\/strong><\/em><\/td>\n<p><\/p>\n<td>Arrrggggg, \u00a1\u00a1\u00a1qu\u00e9 alguien me cambie la tonalidad de mis ojos!!! A los hermanos Wachowski se les debieron acabar todas las tonalidades del arco iris para hacer esta pel\u00edcula tan psicod\u00e9lica.<\/p>\n<p>Nos encontramos en un mundo en el que las corporaciones gobiernan el mundo y el &#8220;automovilismo&#8221; es el deporte rey. Pero pardiez, el mundo est\u00e1 apa\u00f1ado y nuestro &#8220;h\u00e9roe&#8221; tiene que demostrar a diestro y siniestro que \u00e9l es el mejor y que los dem\u00e1s son malos mal\u00edsisisisisisisisimos.<\/p>\n<p>En fin, si os encontr\u00e1is con ganas de ver mil y un colores sin fumaros nada, \u00e9sta es vuestra peli ;)<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td align=\"left\" valign=\"top\"><strong><em>Horizonte final<\/em><\/strong><\/td>\n<p><\/p>\n<td>Realmente esta pel\u00edcula ya la hab\u00eda visto hace muchos a\u00f1os, pero por avatares del destino la he vuelto a ver y aqu\u00ed va.<\/p>\n<p>Nos situamos en el futuro, unos 40 a\u00f1os, y ah\u00ed nos estamos expandiendo por la galaxia. Pero de repente, la nave espacial Horizonte Final, desaparece y aparece unos a\u00f1os con toda la tripulaci\u00f3n muerta y en un silencio inquietante, mientras todo el mundo se hace la pregunta de \u00bfd\u00f3nde ha estado?<\/p>\n<p>Una pel\u00edcula de terror MUY recomendable y m\u00e1s si quer\u00e9is jugar al Deep Space, porque me recuerda extra\u00f1amente a \u00e9l :D (aunque todav\u00eda no he jugado)<\/td>\n<p><\/tr>\n<p><\/p>\n<tr><\/p>\n<td valign=\"top\"><em><strong>Venganza<\/strong><\/em><\/td>\n<p><\/p>\n<td>Nuestro protagonista es un agente del gobierno retirado para poder estar m\u00e1s tiempo con su hija, la cu\u00e1l est\u00e1 en custodia de su exmujer. Pero un buen d\u00eda su hija decide irse a Par\u00eds de vacaciones y de repente es secuestrada&#8230;<\/p>\n<p>Esta pel\u00edcula es una de esas que no te esperas pero que resulta que te impresiona. Bastante cruenta y con im\u00e1genes muy expl\u00edcitas en ocasiones, contiene una historia relativamente sencilla (trata de blancas) pero muy bien llevada y que te mantiene atento durante toda la pel\u00edcula.<\/td>\n<p><\/tr>\n<p><\/tbody>\n<\/table>\n<p>Fi\u00fa, y creo que todas estas son las pel\u00edculas que he visto en las \u00faltimas semanas&#8230; \u00bfa qu\u00e9 no ha estado mal? ;)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Y es que aunque no haya puesto nada de las \u00faltimas pel\u00edculas que he ido viendo, lo cierto es que he tenido un atrac\u00f3n de pel\u00edculas la mar de considerable&#8230; as\u00ed que aqu\u00ed va un peque\u00f1o resumen de todas :D Red de mentiras Ten\u00eda para escoger: o ver \u00e9sta o ver la \u00faltima del 007 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[870],"tags":[],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Atrac\u00f3n de pel\u00edculas - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/ocio\/peliculas\/atracon-de-peliculas\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Atrac\u00f3n de pel\u00edculas - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Y es que aunque no haya puesto nada de las \u00faltimas pel\u00edculas que he ido viendo, lo cierto es que he tenido un atrac\u00f3n de pel\u00edculas la mar de considerable&#8230; as\u00ed que aqu\u00ed va un peque\u00f1o resumen de todas :D Red de mentiras Ten\u00eda para escoger: o ver \u00e9sta o ver la \u00faltima del 007 [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/ocio\/peliculas\/atracon-de-peliculas\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2008-11-25T03:24:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-19T16:40:29+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/peliculas\/atracon-de-peliculas\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/ocio\/peliculas\/atracon-de-peliculas\/\",\"name\":\"Atrac\\u00f3n de pel\\u00edculas - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2008-11-25T03:24:00+00:00\",\"dateModified\":\"2016-02-19T16:40:29+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/ocio\/peliculas\/atracon-de-peliculas\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-bL","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/729"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=729"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/729\/revisions"}],"predecessor-version":[{"id":1982,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/729\/revisions\/1982"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=729"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=729"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=729"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}