{"id":866,"date":"2008-04-17T02:24:00","date_gmt":"2008-04-17T02:24:00","guid":{"rendered":"http:\/\/karstieltopia.com\/2008\/04\/17\/concierto-de-nightwish-con-pain-de-teloneros\/"},"modified":"2016-02-15T22:46:22","modified_gmt":"2016-02-15T22:46:22","slug":"concierto-de-nightwish-con-pain-de-teloneros","status":"publish","type":"post","link":"http:\/\/karstieltopia.com\/ocio\/musica\/concierto-de-nightwish-con-pain-de-teloneros\/","title":{"rendered":"Concierto de Nightwish con Pain de teloneros"},"content":{"rendered":"<p>Hace unas cuantas horas que estaba con <a href=\"http:\/\/ucedaman.blogspot.com\/\">Ucedaman<\/a> en el concierto de Nightwish.<\/p>\n<p>Despu\u00e9s de llegar ligeramente m\u00e1s tarde de la hora que ten\u00edamos prevista, nos encontramos con una megacola impresionante que por suerte no tuvimos que hacer entera porque nos salv\u00f3 el encontrarnos en la cola con un antiguo compi de trabajo&#8230; \u00a1\u00a1graci\u00f1as!! ;)<\/p>\n<p>Una vez dentro (con la marabunta a nuestras espaldas) y pasado el tiempo de rigor, empezaron los teloneros. Ni m\u00e1s ni menos que <strong>Pain<\/strong>, un grupo que conozco desde hace unos cuatro a\u00f1os y que son bastante buenos y, por lo que pude constatar, han sido un descubrimiento para muchos. A ver si es verdad y empiezan a gustar ;)<\/p>\n<p>Por lo pronto os dejo un par de v\u00eddeos de estos individuos (Por cierto, el momento gracioso fue cuando dijo que si quer\u00edamos una canci\u00f3n m\u00e1s, todo el mundo gritando que s\u00ed y de repente dice&#8230; &#8220;Ah, vale, hasta luego! (gir\u00e1ndose y march\u00e1ndose)&#8230;&#8221;&#8230; volvi\u00f3 ;) )<\/p>\n<p><em><strong>Pain &#8211; Shut your mouth<\/strong><\/em><\/p>\n<p><strong><em>Pain &#8211; End of the line<\/em><\/strong><\/p>\n<p>En fin, despu\u00e9s de los teloneros nos toc\u00f3 esperar casi 40 minutos en que <strong>Nightwish<\/strong> empezase y, por fin, \u00a1\u00a1lo hicieron!!<\/p>\n<p>La marabunta grit\u00f3 exaltada, todo comenz\u00f3 como deb\u00eda, todo sonaba impresionantemente&#8230; Bueno, todo, todo&#8230; Hab\u00eda un problemilla&#8230; La srta <strong>Anneke<\/strong>.<\/p>\n<p>Como creo que todos os hab\u00e9is dado cuenta, el \u00faltimo \u00e1lbum es peor que los anteriores. Podr\u00edamos salvar un par de canciones buenas y, el resto, se deja escuchar, pero tampoco tiene grandes pretensiones realmente.<\/p>\n<p>Volviendo al tema de Anneke, precisamente en estas \u00faltimas canciones ella m\u00e1s o menos se defiende: consigue que todo suene como deber\u00eda casi siempre (hubo unos cuantos chillidos que pufffff, mejor no acordarse). Pero el desastre fue en el resto.<\/p>\n<p>Desastre u horror, no sabr\u00eda muy bien como definirlo. Todos os acordar\u00e9is de <strong>Tarja<\/strong> (por aqu\u00ed ten\u00e9is algo de sus \u00faltimas cosas fuera de Nightwish) y su preciosa y potente voz. Y tambi\u00e9n os acordar\u00e9is de sus canciones en Nightwish&#8230; Entonces sabr\u00e9is que esas canciones estaban casi hechas a medida para su voz, para llegar all\u00ed d\u00f3nde ella llegaba y dejaba muchos pasos atr\u00e1s a todas la bandas con cantantes femeninas que siguen este estilo. Pero Anneke no est\u00e1 a la altura, pero ni de lejos, y esas canciones interpretadas por ella han sido horrorosas; tanto que muchas veces ni se distingu\u00eda la canci\u00f3n original.<\/p>\n<p>El detalle estaba en la cara de sufrimiento que ten\u00eda para intentar seguir lo que ser\u00eda la letra en el tono adecuado (aguantaba unos segundos) y la cara impert\u00e9rrita que ten\u00eda Tarja para no solo llegar, sino aguantar todo el tiempo necesario y m\u00e1s.<\/p>\n<p>Sinceramente pienso que se han equivocado de cantante, y si en el \u00e1lbum se nota, en el directo es sangrante.<\/p>\n<p>Como ejemplo, os dejo dos v\u00eddeos de una canci\u00f3n f\u00e1cil, Nemo, en directo ambas y a mitad de concierto (siento que la calidad de la versi\u00f3n de Anneke sea tan mala, pero es dif\u00edcil de encontrar algo que no sea grabado con c\u00e1mara de aficionado, pero para escucharlo se hace una \u00eddea).<\/p>\n<p>Versi\u00f3n de <strong>Anneke<\/strong>:<\/p>\n<p>Versi\u00f3n de <strong>Tarja<\/strong>:<\/p>\n<p>Y en el resto, que eran m\u00e1s dif\u00edciles, daba muuuucho miedo&#8230;<\/p>\n<p>El resto de la banda s\u00ed que se nota que ha ido mejorando con las a\u00f1os y fue perfecta su actuaci\u00f3n (hasta el que cantaba muy poquito antes ahora lo hace a menudo y bastante bien, supongo que por la necesidad de acompa\u00f1ar a Anneke&#8230;)<\/p>\n<p>Resumiento, el concierto estuvo bastante bien, al juntar por una lado a Pain (si no lo conoc\u00edais, buscar cosas de ellos, que os gustar\u00e1n) y por otro lado a Nightwish, aunque del conjunto habr\u00eda que quitar a la cantante, que menudo fiasco&#8230;<\/p>\n<p><strong>Pd. 1. <\/strong>Punto curioso ;) El del teclado ten\u00eda un mu\u00f1eco de Jack Sparrow (m\u00e1s conocido como Esp\u00e1rrago) medio crucificado en uno de los teclados&#8230; \u00bfLo llevar\u00eda por el parecido inherente que ten\u00eda con \u00e9l? ^^U<\/p>\n<p><strong>Pd.2.<\/strong> Otra comparaci\u00f3n con Tarja&#8230; A la srta Tarja se la conoc\u00eda tambi\u00e9n por su sobriedad y estilo al vestir. La cantante actual llevaba un vestido negro, con unas mallas negras por debajo hasta los tobillos y.. ta chaaaan, unas <em>kelly rosa<\/em> como calzado O_O<\/p>\n<p><strong>Pd.3.<\/strong> Ucedaman y yo vimos a <em>Gimli<\/em> entre el p\u00fablico O_O<\/p>\n<p><strong>Pd.4.<\/strong> Y a veces&#8230; \u00a1\u00a1ve\u00edamos sentencias <em>SQL<\/em> por ah\u00ed!! O_O<\/p>\n<p><strong>Pd.5.<\/strong> A la gente le gusta grabar v\u00eddeos con sus c\u00e1maras pasadas de estrangis por la puerta pero&#8230; \u00bf\u00bfqu\u00e9 demonios hac\u00eda una chica con una c\u00e1mara en cada mano grabando el concierto?? O_o<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hace unas cuantas horas que estaba con Ucedaman en el concierto de Nightwish. Despu\u00e9s de llegar ligeramente m\u00e1s tarde de la hora que ten\u00edamos prevista, nos encontramos con una megacola impresionante que por suerte no tuvimos que hacer entera porque nos salv\u00f3 el encontrarnos en la cola con un antiguo compi de trabajo&#8230; \u00a1\u00a1graci\u00f1as!! ;) [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":"","jetpack_publicize_message":"","jetpack_is_tweetstorm":false},"categories":[214],"tags":[245,624,625],"jetpack_featured_media_url":"","jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.1.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Concierto de Nightwish con Pain de teloneros - Karstieltopia<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/karstieltopia.com\/ocio\/musica\/concierto-de-nightwish-con-pain-de-teloneros\/\" \/>\n<meta property=\"og:locale\" content=\"es_ES\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Concierto de Nightwish con Pain de teloneros - Karstieltopia\" \/>\n<meta property=\"og:description\" content=\"Hace unas cuantas horas que estaba con Ucedaman en el concierto de Nightwish. Despu\u00e9s de llegar ligeramente m\u00e1s tarde de la hora que ten\u00edamos prevista, nos encontramos con una megacola impresionante que por suerte no tuvimos que hacer entera porque nos salv\u00f3 el encontrarnos en la cola con un antiguo compi de trabajo&#8230; \u00a1\u00a1graci\u00f1as!! ;) [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"http:\/\/karstieltopia.com\/ocio\/musica\/concierto-de-nightwish-con-pain-de-teloneros\/\" \/>\n<meta property=\"og:site_name\" content=\"Karstieltopia\" \/>\n<meta property=\"article:published_time\" content=\"2008-04-17T02:24:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-02-15T22:46:22+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@karstiel\" \/>\n<meta name=\"twitter:site\" content=\"@karstiel\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"http:\/\/karstieltopia.com\/#website\",\"url\":\"http:\/\/karstieltopia.com\/\",\"name\":\"Karstieltopia\",\"description\":\"Programaci\\u00f3n, tecnolog\\u00eda y a\\u00f1adidos\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"http:\/\/karstieltopia.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"es\"},{\"@type\":\"WebPage\",\"@id\":\"http:\/\/karstieltopia.com\/ocio\/musica\/concierto-de-nightwish-con-pain-de-teloneros\/#webpage\",\"url\":\"http:\/\/karstieltopia.com\/ocio\/musica\/concierto-de-nightwish-con-pain-de-teloneros\/\",\"name\":\"Concierto de Nightwish con Pain de teloneros - Karstieltopia\",\"isPartOf\":{\"@id\":\"http:\/\/karstieltopia.com\/#website\"},\"datePublished\":\"2008-04-17T02:24:00+00:00\",\"dateModified\":\"2016-02-15T22:46:22+00:00\",\"author\":{\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\"},\"inLanguage\":\"es\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/karstieltopia.com\/ocio\/musica\/concierto-de-nightwish-con-pain-de-teloneros\/\"]}]},{\"@type\":\"Person\",\"@id\":\"http:\/\/karstieltopia.com\/#\/schema\/person\/3d09a55c38c7c00e78c41fa3f71a6e75\",\"name\":\"karstiel\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p6AuIG-dY","_links":{"self":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/866"}],"collection":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/comments?post=866"}],"version-history":[{"count":1,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/866\/revisions"}],"predecessor-version":[{"id":1813,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/posts\/866\/revisions\/1813"}],"wp:attachment":[{"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/media?parent=866"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/categories?post=866"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/karstieltopia.com\/wp-json\/wp\/v2\/tags?post=866"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}